[
  { "id": "CP01", "name": "Comprehensive and Transparent Job Advertisement", "description": "Job ads that clearly state core conditions (salary range, work modality, contract type), provide a realistic description of responsibilities and the tech stack, and offer context about the project or company culture." },
  { "id": "CP02", "name": "Verified Positive Reputation", "description": "The company has a strong, positive reputation on external platforms (e.g., Glassdoor), with authentic employee reviews serving as a powerful motivator for candidates." },
  { "id": "CP03", "name": "Specific and Developmental Feedback", "description": "Providing candidates with personalized, actionable feedback that explains the reasons for a decision, highlights both strengths and areas for improvement, and offers guidance for future development." },
  { "id": "CP04", "name": "Relevant and Purposeful Technical Assessment", "description": "Technical assessments (e.g., practical challenges, real-case workshops) that are directly related to the daily tasks of the role, have a clear purpose, and are appropriate for the candidate's seniority level." },
  { "id": "CP05", "name": "Direct Interaction with the Team and Managers", "description": "The R&S process includes opportunities for the candidate to have meaningful, conversational interactions with future team members and hiring managers, allowing for a better assessment of fit." },
  { "id": "CP06", "name": "Humanized and Respectful Interaction", "description": "Interactions where recruiters and interviewers treat the candidate with respect, show genuine interest, listen actively, and create a comfortable, two-way dialogue." },
  { "id": "CP07", "name": "Visible Commitment to Diversity, Inclusion, and Accessibility", "description": "The company demonstrates a genuine commitment to D&I through concrete actions, such as affirmative vacancies, inclusive language, and asking about accessibility needs." },
  { "id": "CP08", "name": "Signals of Long-Term Stability and Growth", "description": "The company provides clear information about career progression, internal mobility/rotation opportunities, and exhibits signals of a stable work environment (e.g., low employee turnover)." },
  { "id": "CP09", "name": "Co-creation of Job Descriptions with Technical Teams", "description": "The practice of involving the technical hiring team in the creation of job ads to ensure the descriptions are accurate, relevant, and realistic." },
  { "id": "CP10", "name": "Streamlined and Efficient Application Process", "description": "Using application methods that are quick and respect the candidate's time, such as simplified applications on professional networks or direct email submissions." },
  { "id": "CP11", "name": "Communication as a Proxy for Company Culture", "description": "The quality of communication during the R&S process (clarity, tone, responsiveness) is perceived by candidates as a reliable indicator of the company's internal culture and how it values its employees." },
  { "id": "CP12", "name": "Soliciting Candidate Feedback on the R&S Process", "description": "The company proactively asks candidates for their feedback on the hiring process itself, signaling that their experience is valued and that the organization is committed to continuous improvement." },
  { "id": "CP13", "name": "Timely and Efficient Process Pacing", "description": "An R&S process that moves at a reasonable pace, with quick turnaround times between stages and prompt feedback, which is perceived as a sign of an organized and respectful company." },
  { "id": "CP14", "name": "Continuous and Transparent Status Updates", "description": "The practice of proactively keeping candidates informed of their status at every stage of the process, even if it is just to confirm they are still under consideration." },
  { "id": "CP15", "name": "Proactive Candidate Redirection", "description": "Instead of a simple rejection, the company identifies a strong candidate's potential and proactively redirects them to a different, more suitable role within the organization." },
  { "id": "CP16", "name": "The Interview as a Learning Experience", "description": "The interview process, especially the technical portion, is structured as a collaborative and dynamic exchange that allows the candidate to learn something new, regardless of the outcome." },
  { "id": "CP17", "name": "Fair Compensation Aligned with Requirements", "description": "The offered salary and benefits package is perceived as fair and directly proportional to the skills, responsibilities, and experience level required for the position." },
  { "id": "CP18", "name": "The Process as a Two-Way Street", "description": "The R&S process is explicitly or implicitly framed as a mutual evaluation, where the company is also presenting itself to the candidate, fostering a sense of partnership and respect." },
  { "id": "CP19", "name": "Proactive Talent Pooling", "description": "A practice where, upon rejection, a promising candidate is explicitly informed that their profile will be kept in a talent database for future opportunities, often leading to subsequent contact." },
  { "id": "CP20", "name": "Technically Proficient Interviewers", "description": "The individuals conducting technical interviews are perceived as competent and knowledgeable, capable of having a substantive discussion and fairly evaluating the candidate's skills." },
  { "id": "CP21", "name": "Effective Use of Automation for Efficiency", "description": "Automation is used appropriately to make logistical parts of the process more efficient (e.g., scheduling) without replacing crucial human touchpoints like personalized feedback or interviews." },
  { "id": "CP22", "name": "Holistic Candidate Evaluation", "description": "The process demonstrates a genuine interest in understanding the candidate as a whole person, including their soft skills and personality, rather than focusing exclusively on technical abilities." }
]
