[
  { "id": "AP01", "name": "Generic or non-existent feedback", "description": "Absence of feedback, or standardized feedback, without specific information about the candidate's performance or the reason for rejection." },
  { "id": "AP02", "name": "Lack of clarity in requirements and job description", "description": "Job advertisements with vague, contradictory information, or with excessive and seniority-incompatible requirements." },
  { "id": "AP03", "name": "Poorly conducted and bureaucratic R&S process", "description": "Selection processes with unnecessary, poorly explained stages, excessive bureaucracy, or conducted hastily and inattentively." },
  { "id": "AP04", "name": "Negative reputation on review sites or social media", "description": "Existence of negative reviews about the company on specialized websites or social media, impacting candidates' perception." },
  { "id": "AP05", "name": "Lack of transparency about contractual conditions before the offer", "description": "Omission or late disclosure of essential information about the vacancy, such as salary, benefits, hiring company, and work location." },
  { "id": "AP06", "name": "Excessive use of jargon or confusing technical terms", "description": "Use of complex language that is difficult for less experienced candidates to understand, hindering comprehension of the vacancy." },
  { "id": "AP07", "name": "Posting non-existent or ghost jobs", "description": "Publication of vacancies that do not actually exist or are closed without communication to candidates, generating frustrated expectations." },
  { "id": "AP08", "name": "Lack of clarity about organizational values and culture", "description": "Difficulty in conveying the company's culture and values during the selection process, leading to misalignment between candidate and organization." },
  { "id": "AP09", "name": "Lack of humanization and clarity in the recruitment process", "description": "Recruitment and selection processes lacking human interactions and clear communication, generating insecurity and demotivation in candidates." },
  { "id": "AP10", "name": "Lack of regular updates on process status", "description": "Lack of communication about the selection process status, leaving candidates without information about their progression." },
  { "id": "AP11", "name": "Unequal treatment among candidates", "description": "Perception that the selection process is not conducted isonomically, favoring some candidates over others." },
  { "id": "AP12", "name": "Perception of discrimination based on personal characteristics unrelated to work", "description": "Consideration of factors such as appearance, gender, race, or academic background as selection criteria, instead of focusing on skills and competencies." },
  { "id": "AP13", "name": "Tests or practical activities disconnected from actual job responsibilities", "description": "Application of practical assessments that do not reflect the daily demands and challenges of the role, leading to an inadequate candidate evaluation." },
  { "id": "AP14", "name": "Delayed or no feedback after interviews", "description": "Delay or lack of communication with candidates after interviews, generating uncertainty and anxiety." },
  { "id": "AP15", "name": "Failure to request candidate feedback on the process", "description": "Not seeking candidates' opinions about their experience in the selection process, losing the opportunity to improve R&S practices." },
  { "id": "AP16", "name": "Excessive automation", "description": "Recruitment and Selection processes that have many automated stages, usually through software." },
  { "id": "AP17", "name": "Lack of standardization in assessments", "description": "Absence of clear and uniform criteria for evaluating candidates, leading to subjective and inconsistent judgments." },
  { "id": "AP18", "name": "Misalignment between selection process stages and job competencies", "description": "Misalignment between the selection process stages and the essential competencies for job performance." },
  { "id": "AP19", "name": "Lack of explanation for decisions made during the process", "description": "Not providing candidates with a clear and transparent justification for decisions made during the selection process, such as non-approval for the next stage." },
  { "id": "AP20", "name": "Lack of recruiter training", "description": "Unprepared recruiters to conduct interviews, assess candidates' competencies, and adequately represent the company." },
  { "id": "AP21", "name": "Unfulfilled promises", "description": "Failure to fulfill promises made to candidates during the selection process, such as benefits, career plan, or other incentives." },
  { "id": "AP22", "name": "Excessively complex tests or practical activities", "description": "Application of tests or practical activities with a level of complexity disproportionate to the job requirements or the time available for their completion." },
  { "id": "AP23", "name": "Irrelevant academic background requirements", "description": "Academic background requirements that are not essential for job performance, unnecessarily limiting access for qualified candidates." },
  { "id": "AP24", "name": "Lack of accessibility in the selection process for people with disabilities", "description": "Barriers in the selection process that impede or hinder the participation of people with disabilities, limiting diversity and inclusion." },
  { "id": "AP25", "name": "Perception of Disorganization and Lack of Technical Knowledge from HR", "description": "Lack of organization and technical knowledge from HR in preparing job descriptions, which can lead to inaccurate or irrelevant information." }
]