{
  "AP03": {
    "T7": [
      "I had an interview for a company [...] they called me for the interview, on the call they said it was an interview, but when I got there it was a group dynamic, for a systems analyst position [...] By phone, it was something completely different from what it was when I got there. - P00",
      "And that, many times, in the interview, the person interviewing, sometimes, wants to do things quickly, wants to interview properly, and the person speaks, or they don't pass on points correctly so the person doesn't have doubts. - P01",
      "the problem isn't getting to the interview and the interview being so-so. The problem is gigantic, but sometimes you don't even get there. Because of the bureaucratic processes of robots on the resume or tests, sometimes, that would measure a person's logical reasoning capacity and all that. - P01",
      "if it's a big company, very big, right? I believe it doesn't influence the person's perception of the company, but it frustrates the person for not having gotten in because of all this bureaucracy. - P01",
      "if it's a company, I don't know, medium or small-sized, that the person doesn't know much about, I believe complicating the processes ends up leaving a negative impression, right? - P01",
      "if it's a process, like, that has a real interest in hiring, not just excluding a candidate, I think it's no longer interesting. - P01",
      "Then normally there's a degree of disorganization, some people are not aligned, but that's just a hindrance, it's not something that prevents or discourages me from doing the selection process for the company. - P02",
      "It's not just because they literally need you, that's not it. But when the communication is good, you understand? Now, when the communication is bad, you already see it's not a good environment. You'll probably be left abandoned, you understand? - P03",
      "What if the recruiter remembered, 'That guy did well. A new opportunity came up that fits his profile. And I'll try to contact him again.' So I always leave it like that, I'm not rude. For you to lose a good employee, things like that, I don't need that. - P03",
      "Yes, there was once a company I was applying for two vacancies simultaneously. I was approved for both, but I declined one because, for example, the guy didn't make the work hours clear. When he said it would be forty-four hours a week, that was a negative point. - P03",
      "Because I find it annoying that we first contact via WhatsApp, but okay. [...] For me, I find it more informal. I prefer email. But that's my personal preference. - P04",
      "But the whole process, always on WhatsApp, I think it gives a certain... I don't know if it's something more informal, something more... It makes us more relaxed. Because it seems to be something simpler, but... - P04",
      "And that already gives us an idea if we did well or not, to receive the results of the next stages. Because nowadays, these processes, they usually have five, six stages. - P04",
      "One I didn't, I didn't follow the process precisely because they were taking too long, I thought... I kept thinking: 'No, if it's like this, taking so long in the hiring process, imagine the disorganization, right? Imagine when you get in there.' - P04",
      "Many companies want to hire you as PJ, but you'll have to work as CLT, you'll have a time to start and a time to finish. We know that PJ cannot demand this. - P05",
      "Basically, that's what I see, I see that many processes are confusing. Few companies make it clear in the description what they really want. - P05",
      "I rate it very poorly [communication with the candidate], at least most of the ones I participated in, the selection process was not very clear, they didn't make it very clear what they were going to, what they were going to consider at the time of your application, what was most important, if it was you having, I don't know, more soft skills, or if it was more important for you to have all - P05",
      "I've felt that, due to lack of technical knowledge, the recruiter wanted to know more than necessary in the first interview. I think these things should be separated. - P06",
      "There was a case of a selection process I participated in, where I was advancing, and, in the message to call for an interview, the woman, the HR employee, got my name wrong. - P07",
      "Yes. I will cite an example where, in an X interview, I ended up giving up on the application a bit, because they didn't know how to say exactly what the team structure would be like - P08",
      "[...] it shows that the company isn't really one hundred percent… internally organized, [which] facilitates a smoother hiring process. So, this delay in feedback, delay in re-establishing meetings, ends up... - P08",
      "Because, if it's already like this in the selection, what will it be like working there, right? Is it disorganized like this, or is it just a specific department that's like this? - P09",
      "[...] I see that it ends up affecting, because we start to fall a bit behind and think if we should really continue in this process. [...] You already start to see a kind of disinterest from the company [...] - P09",
      "[...] it was done via WhatsApp, the contact was more direct, but there was no proper contact. So, like, even if sometimes they try to get closer if it's not something well, like, thought out, what was supposed to bring closer ends up not bringing - P10",
      "And then they changed and only did the resume evaluation. There was no explanation, they changed at the last minute and we had to accept it. So, many times, there's a lack of clarity. - P11",
      "When a vacancy takes too long and I don't see progress… On Gupy you see it going through stages. Sometimes I apply for vacancies and then, when I look, there's a vacancy there for two months and no movement. - P11",
      "There were companies I tried for, the process was cool, they accepted me [...] And there were companies where I went through the process, the process wasn't cool, or they didn't give me feedback [...] I was already working [...] I don't accept - P12",
      "If there is no clear information about the process stages [...] I get a bit wary [...] I become indifferent to it. So that, if it works out, I… let's evaluate the next steps, but if it doesn't work out, I'm like, ah, okay - P12",
      "Because if there are no more mature processes in selecting people to join, how will there be mature processes within the company, right? [...] the company's communication with me, with the person doing the selection process, normally greatly influences the way... how I think it will be within the company, you know. - P13",
      "Usually, what I use most today is LinkedIn, but then it leads to other third-party ones, which would be like Gupy, Indeed… I've even used Glassdoor too, but all of them end up being a bit more complicated - P14",
      "the application flow is very heavy. [...] I have LinkedIn, there I have a resume that LinkedIn itself creates, but then the resume I created [...] I can use it on LinkedIn [...] and have the simplified application, which I like a lot. - P14",
      "sometimes there isn't a culture of feedback [...] But it makes the flow very tiring. Gupy itself, I have to keep updating my resume all the time. - P14",
      "There were others that I had to… the application wasn't very clear. [...] And when I got there, we had to do a technical test, literally a test on paper - P14",
      "There was a girl who passed, there were nine people who were candidates for a single vacancy. In my head, they could have streamlined this process more so I wouldn't have to compete with eight other people for one vacancy. - P14",
      "And for companies that really do something closer, more personal, I think it's really just a little more care. Maybe even narrow it down more. - P14",
      "it affects. I'm not going to lie, because it affects. For example, the one with the technical test, that I had to do on paper, I already left there basically knowing that I probably wouldn't want to work there, because of the process - P14",
      "I missed some classes, because the interview was during class time… what else? It ended up that there was this test that kind of everyone who left it said they didn't feel they did well - P14",
      "Then everyone kind of felt the same way. And I was happy not to have been the only one. Then it was very cold, so I kind of already knew leaving there, like… ah, there's not much advantage for me to come work here. - P14",
      "it seemed like the companies really weren't caring about their process and how disqualified people feel about it. - P15",
      "if I'm the last one, there are twenty other groups, with ten people each group, which, in theory, is the last part of the process. There's no way this can work out. And not enough, a problem happened, they sent us an email saying: [...] reschedule - P17",
      "they try to have a... to say what the stages are, nicely, but we know that internally it changes, right, there isn't, sometimes they say they have a very well-designed process, but you can't advance in these phases - P18",
      "In the past, I've done five interviews in one day. This month, August, I haven't done any. [...] There are vacancies like that where you can progress. There are many applications, I apply a lot, but there's a lot of return. - P18",
      "I think this part of documenting processes, documenting decisions, tasks… This is practical, but it's important. Communication would be in that sense. - P19",
      "I learned that each vacancy needs a different resume. Maybe whoever gives the feedback… You have a one-hour interview to go to a technical one. And they give you a task with a deadline. - P19",
      "What I see most as a problem is not so much the ad, but the process as a whole. The ad has its efficiency, but the process, from beginning to end, especially the screening, has more gaps. - P20",
      "That's why there are so many people promising the infallible method to pass selection processes, because there really is no clarity. And this comes from the companies, not the platforms. - P20"
    ],
    "T9": [
      "For me, a company, when it takes a long time, when it doesn't make the selection processes clear, the impression I get is that it's a very disorganized company, a company that isn't concerned with relaying information to the candidate, leaving it clear. So, that already gives me a bad image of the company. - P05"
    ],
    "T10": [
      "Man, I think it's also for the same topic of taking things into context or not. I think it's very difficult for a company to be precisely fair in this part. Because the way selection processes occur is kind of weird. - P02",
      "When the company has a bad process, right, like, doesn't have much respect, I don't apply for that vacancy anymore and usually I don't recommend it. - P03",
      "And I believe that companies currently focus a lot on… a certain range of initial candidates. So, if they find a candidate they think is strong at the beginning, candidates who could still have been interviewed... - P08",
      "If there's a question like: “What's your mother's name?”, I'm like: “What's the need for this?”. Or: “What's your CPF [Brazilian Tax ID]?”. I'm like: “Why do I have to give my CPF here already?”. If it's just for registration, I usually don't even continue, I stop there. - P11",
      "There were vacancies that asked me, in the first part of the application: CPF [Brazilian ID], date of birth, my mother's name, my father's name. - P15",
      "If there's nothing exceptional, a lack of respect, I try to understand if my profile fills the vacancy. But that's me speaking after having done Civil Engineering, in my second degree. - P19"
    ],
    "T5": [
      "Okay, there was one I participated in, which I found strange, but okay, I was a little scared when I entered the room, when I saw the invitation, because there were five people. [...] Then when I entered, they introduced themselves, [...] - P04",
      "[...] there were three QAs, a Tech Lead, and the… no, there were two QAs, the Tech Lead, the P.O. and the project manager, who also accompanied me throughout the process, along with the recruiter. Then I got a little scared, because there were five people [...] - P04"
    ],
    "T4": [
      "[...] you see a company that doesn't describe very well, that people don't care much, sends, for example, a haphazard email, without special care, a proper description, you already start off on the wrong foot, right? - P09",
      "I know this isn't good behavior, because it doesn't help the company improve, but sometimes you're so… with your head kind of “I want to get through this quickly” - P14"
    ]
  },
  "AP16": {
    "T7": [
      "...when it's something that is more truly interpersonal, when you have more contact with people than with a machine, I think it's important. [...] it's better than just talking directly to the computer, just clicking and moving forward on the form. - P00",
      "they are AIs that read resumes or behavioral tests, I don't know, ridiculous, logic tests, sometimes, that don't even make sense. - P01",
      "the problem isn't getting to the interview and the interview being so-so. The problem is gigantic, but sometimes you don't even get there. Because of the bureaucratic processes of robots on the resume or tests, sometimes, that would measure a person's logical reasoning capacity and all that. - P01",
      "Sometimes, I even apply for some vacancy there that is available on Gupy, but sometimes, for example, out of nowhere that automatic message comes, three, four months later, you don't even know what it's about anymore, you understand? - P03",
      "So, I've used Gupy. [...] I only got one interview when I applied through Gupy. Which I think was luck. Because I applied for several vacancies and never got any feedback. Only those automatic ones. - P04",
      "Mainly on Gupy, where, when you apply for a vacancy there, you apply already putting all possible keywords, all very well arranged, but you are not selected. - P04",
      "It's an indirect communication there, because, many times, the company doesn't even have… some platforms today, like Gupy and such, that you don't even reach a person directly. - P07",
      "[...] even if it's not GUPY, even if it's the company's institutional website, even if it's the application, it's a very dehumanized thing, it's something very cliché, right? It's that random message that you didn't pass, or that you passed [...] - P10",
      "So, I think it's important to convey interest, like, to convey that they are really looking for a person with that profile and to be attentive to people, right? Not just read something that's there on the slide and, like, it seems the process is kind of mechanical - P10",
      "In most companies I see, it's just that robotic communication. There's no contact from someone saying: Look, you didn't pass because of this, this, and this. It's just a standard text, like: You passed to the next phase. - P11",
      "If the vacancy is already like that, I apply right when I see it. But if it goes to Gupy, if it goes to some other portal like that, I already get a little hesitant - P14",
      "And the others were really forms, it was very impersonal. Then, usually, it was to evaluate from good to bad, the moments of dynamics and everything, and then the written feedback. - P14",
      "you will participate in automatic processes, which, sometimes, won't even involve the company, like answering questionnaires, taking online tests, and many times you don't really receive… You spent a good amount of time there, some hours, and you could have been doing something else - P15",
      "Imagine you are a... I don't know, a Motorola that opened a vacancy. Then you will receive ten thousand resumes, you know? And it's humanly impossible. Then you end up having to resort to some mechanism that automates the reading of these resumes, you know? - P17",
      "The problem is that most of these systems are terrible, man. If you have a resume that was made in Canva, these models won't read it, understand? Then you're screwed. - P17",
      "it was very positive, usually everything done or automated. [...] I consider that some things shouldn't be automated, like this process of giving feedback - P21",
      "many times you are dealing more with the algorithm than with people. people really managed to automate this issue of need. - P21",
      "I think there should be a person there who also looks at the resumes that are not being selected, so to speak. - P21"
    ],
    "T3": [
      "So, I didn't have problems with negative feedback, that left me... It's sad, okay, the only thing that makes me sad is this feedback, when you apply on the Gupy platform, [...] because they are automatic things and that bothers me - P04",
      "[...] because they are automatic things and that bothers me, only, but the ones I participated in and everything was very smooth. - P04",
      "Hard to say, because, as I said, most of my feedbacks were automatic. I didn't have feedback where the company really told me something. So I can't say. - P11",
      "So, feedback is what I miss the most. It's very automated, you know? These days, in fact, I received a no, like, for a vacancy, a long time ago that I had applied for, and my name was in brackets... - P16",
      "I mainly evaluate if it was someone who wrote it or if it was a machine that wrote it. And, even when it was a machine that wrote it, I see if there's any relevant information for me to take for my life... - P16",
      "Yes, several times. But more as an automatic response from the platform. - P20"
    ],
    "T9": [
      "I can't put six hundred people through a selection process just to send automatic messages to everyone, that's it. If I want comfort, if I want to show I'm a serious company. - P07",
      "Most of the feedbacks I received, usually… about… This is a number from my head, of course, but I believe… They were automatic messages, which often didn't even really have a reason for my disqualification. - P15"
    ],
    "T2": [
      "in the beginning [...] I used a lot of third-party platforms. Again, Gupy, LinkedIn itself, a lot, okay? [...] Somehow, I realized that there were no relevant results. Then I moved on to company-specific ones. - P12",
      "But on LinkedIn, I stopped looking there a long time ago because... of these complaints I just mentioned [they're either asking for too much, or things that aren't necessary], and also because there's a lot of Gupy, and I think people looking for jobs can't... end up sending too many resumes and won't be able to keep up with Gupy - P16",
      "most are Gupy, right? [...] I had three jobs [...] none of them I went through Gupy. And I don't know anyone who went through Gupy. But most of the processes I participated in were through Gupy, and I had no feedback, you know? - P17",
      "Then, sometimes, the feeling I get on Gupy is of... of being erased, you know? Of not being seen at all, as if nothing on your resume really mattered, because they don't see your resume there. - P17"
    ],
    "T10": [
      "sometimes a person who doesn't have much... Much experience, nor much alignment with the vacancy, but because they wrote a resume, I don't know, the way the robot wanted to see it, was seen. - P01",
      "I think there was more of a disregard for having treated me like a robot, despite me having spent my time, and them having used a robot to say the same patterns to everyone, just altering the name. - P11",
      "And I also believe because… sometimes, the… the management of candidates in the company may not be very good. It could be, sometimes, just an AI at the beginning that will sweep the resumes there and may end up losing many candidates who are interesting, who can be valuable to the company. - P15",
      "Then many things come in… like… things that I think sometimes wouldn't be so cool, but that's what happens nowadays, which is resume architecture, that, for example, you always have to try to respect it as much as possible so you don't get… end up being dismissed by an artificial intelligence and not even have a human there really looking at your resume. - P15",
      "I think this is not very fair to people, but I understand that there are many candidates, so it might happen anyway. But I think these parts here can occur, because, nowadays, companies are not very fair to candidates as a whole. - P15"
    ],
    "T4": [
      "I don't have a uniform view on this, because I think each company behaves differently with candidates, but the vast majority, especially remote vacancies, it's that issue, [...] it's a very dehumanized thing [...] It's that random message that you didn't pass, or that you passed [...] - P10",
      "the evaluation criterion, it already starts from the video you see. Hey, I need a person who speaks English. - P21"
    ]
  },
  "AP05": {
    "T7": [
      "many times you apply for a vacancy and they, I don't know, only wait until the third or fourth stage of the process to tell you what salary you can earn with the company. - P01",
      "Yes, there was once a company I was applying for two vacancies simultaneously. I was approved for both, but I declined one because, for example, the guy didn't make the work hours clear. When he said it would be forty-four hours a week, that was a negative point. - P03",
      "Many companies want to hire you as PJ, but you'll have to work as CLT, you'll have a time to start and a time to finish. We know that PJ cannot demand this. - P05",
      "For these vacancies I mentioned, there's no day-to-day part. So communication is more important. Especially for remote vacancies, because you're not in the company's day-to-day. - P19",
      "I understand that the manager doesn't have this job of 'selling' the company, they want to understand if the candidate is ideal for them, but this also makes it difficult for the candidate, who returns to that point of clarity about what they will do day-to-day, where they will spend the next few years. - P20"
    ],
    "T1": [
      "to improve ads, to improve employee expectations, it would be a more cohesive point, to put more objectivity in the ads, specific technologies, salary, company. - P01",
      "confidential, salary confidential, location confidential. I don't even know how to react to this, because if everything is confidential, that's the process. - P01",
      "Now, if they are shown clearly, I imagine not, because there are many vacancies where we only find out the salary value or something like that, the scholarship value, at the end of the selection process. - P02",
      "That I know... And then I already think it's a bit less, like, sometimes they prioritize technology more than, strictly speaking, the work regime, benefits, things like that. - P03",
      "So, I would say that regarding benefits, the work regime, I would say that there only about four are well described, the rest are average to poor. - P03",
      "I think they should specify better, especially the salary issue. - P04",
      "And also, because I see that people complain a lot about this, that you won't specify the salary. [...] they already know the salary value that will happen, the basic salary that vacancy will have. So, why don't they just put it? - P04",
      "Like this issue of negotiations after hiring. I think that's not... anyway. But at least not for juniors. I think for seniors maybe there is. - P04",
      "I also feel there isn't much clarity regarding the vacancy model. Many companies only mention if the vacancy is PJ [independent contractor] or CLT [formal employment contract] when you're already advanced in the process. - P05",
      "Although I've seen vacancies, for example, mid-level vacancies, that paid a junior salary. And I only found this out at the end of the hiring process. - P05",
      "So, I think, if the hiring model, if the salary, is well below the market, for a mid-level vacancy... A mid-level vacancy won't pay two thousand five hundred. So, I think the company has to make this transparent right at the beginning, so you don't keep advancing in the selection process, and at the end you find out the value of that position. - P05",
      "Ah, and if it's a PJ vacancy, and you want the person to have set hours, you have to make that clear, because we understand that a PJ doesn't have set hours to comply with. - P05",
      "Ah, another thing too, I see many companies that list the vacancy as remote, but, for example, it's remote, but you have to be here in the state of São Paulo, because once a month you have to come to the office, so that no longer fits the telework model, so this has to be clear, if you have to be at the office recurrently. - P05",
      "So you don't have to advance in the selection process and only realize that information at the end. That's very inconvenient. - P05",
      "Sometimes, you find it difficult even to know the work format, whether it will be hybrid, in-person, or one hundred percent home office. - P07",
      "They put home office, but at the time of the interview, many times, they say it's hybrid, that you have to, once, twice, [go to the office], they consider the vacancy as if it were home office. Sometimes, they are leaving this clarity a bit… doubtful in the job descriptions - P08",
      "Salary is something that is never described in the suggested vacancy. Sometimes, we talk a bit more about salary when the recruiter comes to our personal chat to talk a bit about the vacancy, which they still touch on superficially. [...] asking what salary we intend to receive. - P08",
      "I believe that functionality, requirements, benefits are always clearer in the interview requests, but this part about salaries and other points are usually more related to personal meetings... - P08",
      "And then, especially, usually what's never there is the salary value, for example, the remuneration. It's one of the things that is practically non-existent in vacancies. - P09",
      "Man, the salary, as I already commented, right? [...] it's a very crucial point, because then you can already have a basis. In the end, we plan based on many things, right? - P09",
      "[...] vacancies that are three different positions in the same vacancy, a seniority, for example, entry-level, which is an internship with a requirement of proven experience. - P10",
      "[...] sometimes, the lack of perception of seniority or requirement, you know, with the budget for that vacancy, or many times there isn't even a budget to know, right, you only find out at the end of the process, that's also a problem - P10",
      "I don't think it's cool when the vacancy doesn't have, from the beginning, the value it's pegged at. Because that leaves it very open, like, oh, you can't make it too clear that you want to know the value, so as not to seem desperate - P10",
      "It could mention salary, but usually most of the vacancies I've seen don't mention salary, we only find out later. Few vacancies state it from the beginning. - P11",
      "Yes. I notice that many descriptions, especially those on hiring platforms like Gupy, platforms used by small and medium-sized companies [...] have a lot of difficulty with descriptions [...] they don't display information [...] about what the minimum and maximum salary range for that vacancy might be - P12",
      "it's rare to see salary, salary range in a job. [...] in my experience, when I was starting college [...] I didn't like, actually I hated the question, what is your salary expectation? - P13",
      "one thing they don't really show is the salary expectation, it's something I didn't like about that, you know, that information. - P13",
      "They fail with this information. [...] they don't explain this part about salary range properly. It really stays until the very end for you to understand, or until you get to the interview and ask. - P13",
      "salary part, sometimes they don't want to show it at first, but at least put an average, right, the average salary for this one, according to so-and-so, put a reference to show it's impersonal - P13",
      "About tools, as I told you in the first question, I think there's still a certain lack of clarity. About salary, there's no clarity on that, zero. Sometimes, very few vacancies show this information. - P16",
      "And there's also another perspective, which is about lack of information, which has already become standard: not informing, usually, remuneration. - P17",
      "It would also be interesting to have the remuneration exposed, but that has already become a utopian dream, you know? - P17",
      "I also look there, whether you like it or not, when there's a salary, which is very difficult, which is something that's very lacking, it's very much 'to be agreed upon' and there it often remains uncertain how much that vacancy is paying - P18",
      "Benefits should also be exposed. It is necessary to know what one is receiving. Something rare to see is the salary. Most of the time, it's 'to be agreed' or only at the end of the process. - P20",
      "This is annoying, because if the person is looking for a salary improvement, they could avoid wasting time. I've been through an entire process thinking the salary would be Y and the company offered X. It was a waste of time for both. - P20"
    ],
    "T9": [
      "I don't care, I end up not giving much emphasis to that... to the process, like, when the person says: 'Ah, we'll talk on such a day, no, later I'll tell you what the value is, later I'll tell you what the technology is, things like that', I simply let it go, I don't go after it, you understand? - P03",
      "And another thing, it's not usually in the description, but they don't give much feedback on the processes, but I think that's something for later. Related to job descriptions, something to improve would be the description of what the minimum salary they pay is. - P12"
    ],
    "T8": [
      "If the criteria are clearer… Most vacancies have a list of 20 prerequisites to earn less than minimum wage. I wonder if the company's culture is aligned with mine. - P19"
    ],
    "T2": [
      "About the organizations. So, if I see that the company has many bad reviews, or has... Or like, I don't know, sometimes the company didn't inform about the salary, and I see there that the salary is very bad... Then, like, I already get, I no longer feel comfortable proceeding with that selection process. - P05"
    ],
    "T10": [
      "As I've already mentioned, I find it unfair when there is no response, or when the vacancy demands more than expected for the level (junior, mid-level, or senior) and the salary does not match the requirements. - P06",
      "I was a life project teacher [...] Besides that, I finally got a quality position [...] In a laboratory, but the laboratory doesn't pay what a junior earns nowadays. - P21"
    ],
    "T6": [
      "when you start to get in and you perceive a salary range, an average salary, you have another question [...] and then, how are you going to state a salary expectation and you put it low, to seem humble, or high, to show off - P13",
      "Just to specify a bit more, the benefits issue is what really gets you, because, depending on the company [...] there aren't great benefits for the role, especially for interns - P14",
      "And career plan too, which is important, as I've interned in State places and I knew that from there I wasn't going anywhere, literally. From intern I wasn't going to pass without anything. - P14",
      "Workload issue, issue of... I think, sometimes, for example, also, the scholarship amount is interesting, but I know that, due to the company, sometimes, it may not happen. Benefits. And I think that's it. - P15",
      "if it's in-person or not remote, usually I would have to move cities and have the whole issue of the burden of living in a city… living in a bigger city, probably. - P15",
      "When I worked in-office, it was five hours by bus per day. I feel this lack of opportunity, especially with the option of hybrid or remote. Someone distant can work from anywhere. - P20",
      "The work mode (in-office, hybrid, or remote) is crucial, mainly because of my distance from the center of many companies. I rejected a vacancy because I had to spend three hours on the bus to go, even though it was hybrid. - P20"
    ]
  },
  "AP13": {
    "T7": [
      "they are AIs that read resumes or behavioral tests, I don't know, ridiculous, logic tests, sometimes, that don't even make sense. - P01",
      "it affects. I'm not going to lie, because it affects. For example, the one with the technical test, that I had to do on paper, I already left there basically knowing that I probably wouldn't want to work there, because of the process - P14"
    ],
    "T8": [
      "Cultural fit I think is fair, you know? [...] But most of the ones I did, like, I found them very, like, meaningless. [...] from left to right, what suits you best?. Then it's, like, on one side there is, I don't know, I like hamburgers, and on the other there is, I don't know, I like my family. - P17"
    ],
    "T10": [
      "Selecting based on two, three conversations and a test… I'll give an example: the selection culture in Japan. If you did two years of ASD [Systems Analysis and Development], met deadlines, delivered in disciplines, for Japanese culture, you can already do anything. - P19",
      "It's common in Japan to choose someone who studied Letters to work in a factory. I consider selections unfair. The vast majority. I said 'all' to make it clear that most are difficult to consider fair. - P19"
    ],
    "T5": [
      "Some, I'd say are pointless, others are cool, are better. Some technical tests I find pointless, for example, they don't specify in the vacancy what... - P03",
      "Then the worst, there was one that was a technical test, the lady opened the document in a call, said the call would be recorded and that I couldn't search, you understand? Then I thought: 'Is this an entrance exam?' - P03",
      "Because when we're working, obviously, we don't go: 'No, I'm not going to search.' Obviously we have means of consultation, right? But like, I didn't understand why, but it's up to each company, right, to do this or not. - P03",
      "[...] they are things like that. They are usually the best. Now, just complementing, written technical tests, things like that, in my view, are pointless. Because they don't give you a script. 'Ah, study this here because some things might come up.' It doesn't exist. You understand? - P03",
      "But there are many companies that I've heard, at least some colleagues commenting, that, like, sometimes they required a test that didn't even, didn't have much to do with what you were going to do. But, at least, the ones I did were tests that were more technical interviews, and it really was focused because I really would use it day-to-day. - P05",
      "All the leveling tests that will say if I go to an interview or not, they are, in my conception, futile in relation to the day-to-day of the vacancy, you know? - P07",
      "Although, generally, these technical challenges don't show much of the reality, the functionality of… the company employee, it's more a matter of encompassing the maximum knowledge they are requesting in the... - P08",
      "I think it's important, like, many times I don't say that the interview necessarily has to have an interview watching you code, or something like that, because I think it even hinders many times, because in day-to-day life it's not like that. - P10",
      "[...] sometimes you make a mistake on something you already know. And then it gives that image that you don't know, but sometimes you don't even make a mistake. It's more the nervousness of doing that with that certain pressure. - P10",
      "But other times there are activities that I'm like: Folks, what activity is this? What's the need?. Like, make a list here and return some items. I'm stuck. What's the need for a test like this? I wanted something more elaborate. - P11",
      "Man, I think practical test, like it was… practical no, right? But it was literally a test I had to mark among the options. I think… I found it a bit unnecessary at the time. - P14",
      "there are things that sometimes I don't remember, there are things that sometimes I'll think is one thing but it's another, but when I'm programming, when I'm developing, I'll know, you know? - P14",
      "There, on paper, looking at the line of code, the answer won't always come to me, I won't always know exactly, but, sometimes, intuitively, when I'm programming, I can do the thing - P14",
      "an assessment like that, literally pen and paper, I don't think it was necessary. Especially because we had to write… we also had to write an introduction text and had to answer the questions with a time limit. - P14",
      "I think it could have been another way, it could have been another methodology, another way to be able to evaluate the person. - P14",
      "Because in the day-to-day work you will have things you won't find, you will have things you won't know, and you take it and you learn and redo it, and so on. - P14",
      "I believe more in tests that are more specific to your vacancy… that you are applying for. You can… gosh, I can't even count the number of tests I've done related to Portuguese tests, logic tests, which sometimes can't really prove the candidate's quality, their technical quality. - P15",
      "several applications you make, you have about ten tests, seven, five tests for you to do, and they are based only on your scores. - P15",
      "many people can go there, get a GPT, copy and paste it, and answer everything at a hundred, and I don't think it will even… equate… It won't see how you answered each test, but your score. - P15",
      "some other tests there, like Portuguese and some things that won't really affect or measure your quality… - P15",
      "Now, the biggest problem is when there are companies that want to ask for cultural fit, that want to ask for... a logic test. Logic tests are horrible! And I've done some logic tests that are absurd, man, that... they're designed to drive you crazy! - P17",
      "And the worst is when it's... a test. A test for me doesn't make sense. Like, how do you want a developer, and you give them a test? Like, as if the guy was going to take tests in the day-to-day of the company, understand? - P17",
      "Now there were others that just asked me to do a CRUD that you do there in any YouTube tutorial. [...] No, they're not trying to find out if you'll understand the company's tools, you know? - P18",
      "In the beginning, I was against the activities. Some don't make sense for the job. I understand those that assess the employee's social aspect, but I can understand practical activities related to programming and logic, to see if the professional has the knowledge. - P20",
      "The market went through a 'scare' with the pandemic, with the 'six-month seniors'. So, I think it's fair to have practical programming tests. But the activity needs to be something that will be applied day-to-day, and not just for the company to say it 'follows standards'. - P20",
      "There was a process with a programming challenge that was simply copied from LeetCode. How does this demonstrate my ability, if I can copy the answer from there? But I think it's fair to have practical activities relevant to the vacancy. - P20",
      "Many times in these vacancies there's a logic test. [...] which many times I consider not so necessary for some vacancies - P21",
      "I would like to do a job test, a vacancy test, that is related to what I will do day-to-day. - P21"
    ],
    "T4": [
      "I'm kind of against it [the standard]. Like, most follow a… Ah, you apply, a little logic test that has no relation to the vacancy, normally it's just a logic test to level. - P07",
      "And then, in this practical test, there was just a... general overview of what was to be developed, [...] and then there was the description: 'develop such application with such thing, and we will evaluate your code'. And then there wasn't a very well-defined criterion. Basically, they would evaluate your code. That was the criterion. - P09"
    ]
  },
  "AP20": {
    "T7": [
      "And that, many times, in the interview, the person interviewing, sometimes, wants to do things quickly, wants to interview properly, and the person speaks, or they don't pass on points correctly so the person doesn't have doubts. - P01",
      "Look, I think in general it affects, but I don't think it's a point to make me give up on a vacancy, only if it's something grotesque, but in general there are HR departments that are more or less prepared and that have more or less support to deal with these selection processes. - P02",
      "[...]Because, like, usually interviews are divided as follows: first you talk to the recruiter, who is usually a person who doesn't understand technology. So there you have to be a more polished person. Like, not that in the process you don't have to be polite, on the contrary. [...] - P03",
      "But the whole process, always on WhatsApp, I think it gives a certain... I don't know if it's something more informal, something more... It makes us more relaxed. Because it seems to be something simpler, but... - P04",
      "Yes. I've participated in selection processes where I felt that people were very, how can I say, very... harsh, perhaps, very, you could even say unfriendly, a very robotic thing. So, that already affects the person's decision, you start thinking: wow, what a place, the people are so cold [...] - P05",
      "I've felt that, due to lack of technical knowledge, the recruiter wanted to know more than necessary in the first interview. I think these things should be separated. - P06",
      "Mainly when we end up asking about parts, like, either more technical, or more structural, or more cultural aspects of the company, and the recruiter kind of tries to push that content to the next meeting - P08",
      "[...] they have to convey professionalism, they have to convey interest, listen to the candidates, demonstrate that they are really looking for the ideal profile. There are companies that conduct interviews and it seems like it's a prompt there, that they are reading a prompt, you know? - P10",
      "If who represents me is disrespectful, I will think everyone is. If the person is kind and shows interest in helping, I will think everyone is like that. - P20",
      "recruitment company [...] it won't have a mea culpa because it will only be wanting to meet the need of the company that is hiring it. - P21"
    ],
    "T1": [
      "Hire qualified recruitment and selection people to understand the positions, because I think many times an HR person who is working, sometimes is a generalist, or sometimes... - P10"
    ],
    "T3": [
      "I don't know the people who give the feedback, so I take it into consideration up to a certain point. [...] It's a matter of mental sanity. If you take all feedback into account, it gets complicated. - P19",
      "If the feedback comes from the technical interview, it has validity. If it comes from the beginning of the selection process, maybe it's not so relevant. - P19",
      "It's not Manichaean. There are shades between black and white. Important issues, like work, behavior, personal issues, it's difficult to receive feedback from someone who hasn't worked with you. - P19"
    ],
    "T10": [
      "The initial part you have with the recruiter also depends on a factor, whether the recruiter will or not... [...] if they don't like your profile, they sometimes judge you there and that's it, you see? - P04"
    ],
    "T4": [
      "I can perceive it in two moments: when it starts, because someone defined the rules, and if the person interviewing knows something or is just stalling. [...] If there's no limit, we don't know the materiality of what will be delivered. [...] It gives me the notion that they know what they're asking for. - P19"
    ]
  },
  "AP25": {
    "T7": [
      "But, in general, I find it a bit disorganized. But I understand that maybe it's HR that writes these descriptions. They don't have a slightly more technical understanding of the requirements. - P02",
      "[...]Because, like, usually interviews are divided as follows: first you talk to the recruiter, who is usually a person who doesn't understand technology. So there you have to be a more polished person. Like, not that in the process you don't have to be polite, on the contrary. [...] - P03",
      "you perceive with the company's communication, depending on how the process is, if there's a group, if a WhatsApp group has already been created, if it's only by email, if it's only through the selection process platform, you already perceive the personality well, right? It's something that, depending on the way it's communicating with you, you see how organized and structured that company itself is, right? If it has mature processes and such. - P13"
    ],
    "T1": [
      "Many descriptions are somewhat controversial, because it seems like people from the field didn't write them, or, I don't know, they're just saying that to weed out candidates, the vast majority of these vacancies. - P01",
      "Hire qualified recruitment and selection people to understand the positions, because I think many times an HR person who is working, sometimes is a generalist, or sometimes... - P10",
      "[...] due to lack of technical knowledge of that position, information is lacking. Not for lack of will to make something complete, but for lack of understanding of how that vacancy works - P10",
      "sometimes, the person who makes these job ads puts that the person needs to know Node. But the person doesn't need to know Node, right? - P16",
      "I think it's essential to have someone from the department, or someone who fulfills that role within the company, helping to put together these aspects of the... ad, so we can be more certain. - P16",
      "But I think that, sometimes, HR people don't have much of an idea of what they're writing there. And they're either asking for too much, or things that aren't necessary, but because they read it somewhere, they think it's cool - P16",
      "there are companies that are not focused on technology, but have a technology sector. Then usually the person who writes the vacancy is a non-technical person, and the vacancy will be like that, right? Experience in computer languages [...] eighty languages - P17",
      "Difficult, because whoever posts the vacancy, often, doesn't have the technical knowledge to filter [...] they ask for five years of experience in FastAPI, a framework created in 2020. The creator of the tool wouldn't be able to pass the vacancy! - P19",
      "If I see requirements that don't make sense, I have difficulty knowing if they have a problem to be solved. [...] If I say: I have this problem in data science [...] For that, you don't use Java, you use Python. - P19",
      "This clarity, which is basic, seems not to exist. Lastly, the work mode: in-office, hybrid, or remote. Many times the vacancy is listed as 'Remote - Brazil', but in the description, they require residence in a certain state. - P20",
      "many times it seems that the person who posts the vacancy on LinkedIn [...] just copies and pastes a ready-made text and doesn't look at it - P21"
    ],
    "T3": [
      "If the feedback comes from the technical interview, it has validity. If it comes from the beginning of the selection process, maybe it's not so relevant. - P19"
    ],
    "T10": [
      "I feel uncomfortable. There have been, for example, vacancies I was going to apply for and there in the vacancy they asked you to immediately inform your mother's name, father's name, CPF [social security number], RG [ID card], I find it unnecessary, even for the first moment. In fact, I think this even violates a law, which is the data protection law. Some companies do this. - P05",
      "It's not fair the way resumes are analyzed, these issues. In the company I'm in now... it's even strange, because they are very different. When I joined the company, they did applications through forms - P16"
    ]
  },
  "AP10": {
    "T7": [
      "Sometimes, I even apply for some vacancy there that is available on Gupy, but sometimes, for example, out of nowhere that automatic message comes, three, four months later, you don't even know what it's about anymore, you understand? - P03",
      "Communication with the candidate is only good when there is literally that match with your resume and what the company wants. Which is generally harder to happen. - P03",
      "One I didn't, I didn't follow the process precisely because they were taking too long, I thought... I kept thinking: 'No, if it's like this, taking so long in the hiring process, imagine the disorganization, right? Imagine when you get in there.' - P04",
      "Interview, generally, we do an interview with the recruiter and after a month we get a response saying there will be another interview, by then, in the meantime, you've completely lost interest - P08",
      "[...] it shows that the company isn't really one hundred percent… internally organized, [which] facilitates a smoother hiring process. So, this delay in feedback, delay in re-establishing meetings, ends up... - P08",
      "Man, generally, when the company takes a long time, for example, to give a return, or we see that you send, sometimes, an email wanting to know more information about the process, and people don't respond [...] - P09",
      "[...] I see that it ends up affecting, because we start to fall a bit behind and think if we should really continue in this process. [...] You already start to see a kind of disinterest from the company [...] - P09",
      "When a vacancy takes too long and I don't see progress… On Gupy you see it going through stages. Sometimes I apply for vacancies and then, when I look, there's a vacancy there for two months and no movement. - P11",
      "So I think transparency matters a lot regarding the image and reputation as a whole, because if you get rejected due to a record issue and all that, don't receive even a minimal response, you will tell your colleagues and all that, this affecting the company's reputation in general and for future candidates too. - P15",
      "I think if it could bring some useful information, it would be like... average response time, I don't know, a month, two weeks, you know? [...] Because I've known people, including, who were hired, who were approved in a selection process six months later - P17"
    ],
    "T3": [
      "I think the candidate… or receiving general feedback right away in the meeting, that would help a lot, not keeping that pressure of waiting for the return. I think when we do an interview, we are [with] a recruiter, in the interview itself I already have a brief notion [if] that user will continue or not with the application, so I think in the meeting itself, leaving it as... - P08",
      "the others that were a bit more regional, really… I didn't get a return message, even when I didn't pass. That was really complicated, really. I was just left hanging. - P14",
      "I ended up getting used to understanding that 'return to the selection process' by email means negative feedback. But the few positive feedbacks I received were good for knowing what to study, where I went wrong, and what to do for the next vacancy. - P20"
    ],
    "T9": [
      "Usually I send an email, I follow up by email, if it's not very clear what part of the selection process I'm in. Or sometimes, I just move on to the next vacancy, if it's not that clear. - P00",
      "It's very difficult to react. The process just shows things. - P01",
      "Look, to be honest with you, I think, I don't know, I must have done some selection processes and only one company got back to me about how their selection process worked. And it was the company I got into. - P02",
      "Look, I think it does influence, this communication influences a lot. But I've encountered so many cases of companies that didn't respond, that didn't give feedback, didn't comment on how the selection period was, they simply approved or rejected, that I ended up finding it kind of normal, you know? - P02",
      "Man, I get really mad. I hate it. Being in the dark is very bad. I keep sending emails, I keep bothering. All forms of contact, I get in touch to know what's happening. - P02",
      "Because, right, you're there dedicating your time, wanting to progress at some point and then you... blackout, right? It seems like the company ceased to exist, canceled its CNPJ [tax ID], right? - P02",
      "[...] but, for example, Gupy's, I have a little over three years in the market, I think I only received in this whole period that I try and all, once a response from there, a single time in over three years, to give you an idea of how bad it is [...] - P03",
      "[...] and sometimes when we respond, they [recruiter] ask what your salary intention is, what technologies you know, this and that, we pass this to them and they simply disappear. Most don't give you any response. - P03",
      "There was another example too, of this one that contacted me, I replied: 'Hey, can we schedule a time? I have a certain hashtag, x salary would be interesting'. I think they replied on WhatsApp, the contact was via WhatsApp, they replied on WhatsApp, I think two months later [...] - P03",
      "[...] when I saw the message I didn't even know what it was about, then I thought about it, I remembered what it was, what it was about, just to show you the level. So, I'd say this communication is very bad. - P03",
      "I don't care, I end up not giving much emphasis to that... to the process, like, when the person says: 'Ah, we'll talk on such a day, no, later I'll tell you what the value is, later I'll tell you what the technology is, things like that', I simply let it go, I don't go after it, you understand? - P03",
      "To know information. Things like that. I simply abandon it. Because it can be for two reasons: either it's really a very bad process. Or they ended up finding someone else and do that, you understand? Like, if I'm a recruiter and I'm talking to three people, and I immediately ghost you [...] - P03",
      "[...] or I don't answer your responses well... it's because probably... responses no, I don't answer your questions, probably among the three there that I was mapping, one already satisfied and already closed the vacancy and that's it, you understand? - P03",
      "Wow, I think it's hard to analyze that, right? Criteria for... Because the vacancies, you see that you fit all the points, but you're not selected. - P04",
      "And it ended up that I got in touch and I was disappointed, because I did the whole process, and they took too long, like, it was a month to answer me, for the new phase to come. - P04",
      "Ah, I think that… Especially if the person is unemployed, waiting for results, because sometimes they depend on feedback. I find it very absurd. I think you have to have this… You have to have this responsibility, [...] - P04",
      "And there have been others that I applied for and participated in the selection process and to this day I have never received any feedback. So, let's say it's average. Some are very good and others are very bad. They don't give the person an answer, no feedback at all. They don't even say if you passed or if you were rejected. - P05",
      "It can, for sure. When you apply to a company and you see they give no feedback at all, especially when you advance, have already advanced in the selection process, for me, I think it's the minimum the company can give, is feedback, even if it's, like, a bit more automatic [...] - P05",
      "When I see that a company gave no feedback at all, I don't even try anything with that company anymore, for another vacancy. - P05",
      "So, I think this discourages the person. If I'm participating in a selection process, and the company doesn't make clear what the next steps are, most of the time I question, after this conversation, what will it be? And if the company there doesn't, most of the time I also send a message, sometimes an email [...] - P05",
      "For me, a company, when it takes a long time, when it doesn't make the selection processes clear, the impression I get is that it's a very disorganized company, a company that isn't concerned with relaying information to the candidate, leaving it clear. So, that already gives me a bad image of the company. - P05",
      "I think it's negative. Regardless of the answer, positive or negative, the company should provide a response. The candidate is left not knowing if they meet the job profile or not. Communication is fundamental. - P06",
      "Yes, it shows that it's a disorganized organization, but, in some cases, it's understandable, the company that… you take the example of the pandemic, the digital transformation was very large. - P07",
      "I think this point is the same one I even commented on, which was related to this delay in information return… that impacts, mainly, if we are in doubt or not if we will leave the current company. - P08",
      "Man, I get pretty discouraged. [...] if the company ends up not giving us this return, it ends up causing that discouragement and, sometimes, we don't even have hope of continuing in that vacancy anymore and already start looking for others [...] - P09",
      "So, I've had my own experiences, mine and my colleagues', where we practically applied for a vacancy, and then we didn't get any feedback, if we were accepted, if we weren't accepted. It's still there to this day [...] - P09",
      "[...] due to communication failure, the company ends up losing a good professional because there's no correct feedback, and then the professional goes and looks for another vacancy, for example, because they couldn't get feedback from this other one. - P09",
      "[...] at least an update on the process status, how it is, how the evaluations are going, so we can know what's happening and if the vacancy, for example, hasn't been frozen, or things like that. - P09",
      "Ah, I see it as neglect, neglect, because sometimes, like, it's been a long time since you passed a stage, there might be one and a half updates, look, they are still analyzing, I apologize for the delay, but most of the time there isn't, right? - P10",
      "[...] sometimes the person has already, the position has already been filled and you are there waiting for a response from a stage, so I think it's neglect with the candidate, like, I find it very bad. - P10",
      "Usually I try to follow up, sending an email or trying to contact a recruiter on LinkedIn. If I don't get a response in either case, I note it on the list that I probably didn't pass - P11",
      "And another thing, it's not usually in the description, but they don't give much feedback on the processes, but I think that's something for later. Related to job descriptions, something to improve would be the description of what the minimum salary they pay is. - P12",
      "I removed from the list of companies I want to work for those companies that didn't get back to me at all. Anyway, this is very negative, okay? - P12",
      "when I don't have clear information about the step-by-step of the process, I wait. Now, I expect to be notified, at least. [...] if they don't get in touch, you quickly get in touch to say, hey, I'm here, I'm alive, so, what's the status? - P13",
      "there was a process here that I had to call the recruiter to find out when the result would come out, you know? Because they said a date, it had already passed the date, about two days, then I spoke to her, because I wanted to know. - P14",
      "If I don't have clear information about the status of my process, it causes me a lot of anxiety and, in the end, maybe it generates frustration. - P14",
      "usually, the ones that don't give status… there are many that, at least that I went through (my experience), the ones that didn't give me status throughout the process were the ones that sent to third parties. - P14",
      "Ah, it's like a talent pool. It's a completely generic thing. You'll never know if you're called. [...] So talent pools I have a bit more “little hate” for, I'm not such a fan. - P14",
      "And every time you go in there, the talent pool has been open for three months and zero movement. [...] it's just another vacancy you're going to apply for, if it's still there, and that's it. - P14",
      "but the people who are really progressing… advanced, received feedback, and you later just receive… the process ends and you just receive the email saying: unfortunately, we will not continue with your application. - P14",
      "It impacts a lot, because it will affect the view I have of the company. [...] I just had to kind of chase after feedback. It's not a bad company, because the whole process was very comfortable, it was very good, actually. - P14",
      "But the ones that don't give feedback, the ones that, for example, just open there on Gupy, you send an email, you don't have much, you know? [...] I didn't create, at least, any emotional attachment - P14",
      "Very bad, very bad, because, if you're very interested in a vacancy and all, you end up getting very anxious. That's not good for anyone, right? Anxiety is horrible. But it's a more personal issue, you know? - P16",
      "I, kind of, freeze the person. So, I think it's important to have this monitoring of the selection process, like, kind of... what's the word? I don't know anymore, sorry, my brain is already fried. But it's good to have this monitoring, like that. - P16",
      "when you don't receive feedback, you remain in the eternal expectation that the process might resurface like a phoenix from the dead, and something might come up, you know? - P17",
      "Then, I don't know, to this day I haven't received a response, you know? So, it's complicated, man. I think the biggest cause of anxiety today is the lack of feedback, the lack of a... Transparency like that. - P17",
      "nobody shows up, nobody shows up, nobody shows up, a week, two weeks, three weeks... And another colleague of mine who was in another group said: Luan, the dynamic has already happened, I was approved, you know? [...] they didn't give us any feedback - P17",
      "sometimes they say they have a very well-designed process, but you can't advance in these phases, you're barely communicated if you passed a phase or not, so sometimes it's very much on paper and very little in practice - P18",
      "I keep sending emails. And then, is there any progress? I really follow up [...] But if the person says they will communicate and leave that channel open, I will go after it. - P18",
      "Firstly, as a candidate, I try to interpret signs, like a 'conspiracy theory'. I thought: 'I didn't pass because I said such a thing and the recruiter reacted in such a way'. - P20",
      "This made me paranoid, wondering if something I said eliminated me. Today I'm calmer, but, for a period, I was very anxious. - P20",
      "This lack of clarity generates distrust and leaves the candidate insecure. - P20"
    ],
    "T2": [
      "In this research process, I see many feedbacks in the comments, from people saying if they received a response, if they didn't… [...] the Gupy site – I've applied there numerous times and never got a response. - P06"
    ],
    "T4": [
      "Most of the time, like, for example, it happened to me: I was applying for some vacancies a while ago and I left my cell phone off. Then I received contact from two recruiters. One simply didn't even bother to answer me anymore [...] - P03",
      "At least what I consider minimal is to get a response for that vacancy. [...] a good part of those I applied for [...] through third-party platforms [...] didn't get back to me, you understand, they didn't get back to me - P12"
    ]
  },
  "AP07": {
    "T7": [
      "On LinkedIn, like, although you have a lot of ghosts there, like, in the sense of, today we know there are many fake vacancies, right, the market is like that, but you still manage to get a better little response, here and there, a contact from a recruiter [...] - P03"
    ],
    "T1": [
      "There are still vacancies that seem to be ghost vacancies, because they simply appear and then disappear. - P01",
      "I think today the biggest problem is that recruiters... I don't know if this is a problem that replicates to other areas, but I think the biggest problem is that recruiters today are, like, leaving... vacancies open on LinkedIn for over a year. - P17"
    ],
    "T9": [
      "[...] sometimes the person has already, the position has already been filled and you are there waiting for a response from a stage, so I think it's neglect with the candidate, like, I find it very bad. - P10"
    ],
    "T10": [
      "I don't even enter. Like, there are several situations, for example, where you go, sometimes, to apply, many times, scams... they ask for ID, they ask for mother's name, they ask for I don't know what. I see that, I leave the registration immediately. - P10"
    ]
  },
  "AP01": {
    "T7": [
      "Communication with the candidate is only good when there is literally that match with your resume and what the company wants. Which is generally harder to happen. - P03",
      "So, I've used Gupy. [...] I only got one interview when I applied through Gupy. Which I think was luck. Because I applied for several vacancies and never got any feedback. Only those automatic ones. - P04",
      "Because, for example, sometimes I applied for vacancies where I had all the technical qualifications and it didn't work out. So, I was kind of like, why didn't it work out? Where did I go wrong, since I received very good technical feedback, at least. So, I think sometimes it's not very clear what they are taking into consideration - P05",
      "I find the criteria often flawed, without clarity. [...] You don't see a criterion. [...] many times they don't bring clarity as to why you didn't pass. - P11",
      "In most companies I see, it's just that robotic communication. There's no contact from someone saying: Look, you didn't pass because of this, this, and this. It's just a standard text, like: You passed to the next phase. - P11",
      "There were companies I tried for, the process was cool, they accepted me [...] And there were companies where I went through the process, the process wasn't cool, or they didn't give me feedback [...] I was already working [...] I don't accept - P12",
      "sometimes there isn't a culture of feedback [...] But it makes the flow very tiring. Gupy itself, I have to keep updating my resume all the time. - P14",
      "you will participate in automatic processes, which, sometimes, won't even involve the company, like answering questionnaires, taking online tests, and many times you don't really receive… You spent a good amount of time there, some hours, and you could have been doing something else - P15",
      "So I think transparency matters a lot regarding the image and reputation as a whole, because if you get rejected due to a record issue and all that, don't receive even a minimal response, you will tell your colleagues and all that, this affecting the company's reputation in general and for future candidates too. - P15"
    ],
    "T1": [
      "You apply for the vacancy and end up getting feedback that your technologies are not compatible with the vacancy, when the vacancy didn't even show which technologies would be necessary - P15"
    ],
    "T3": [
      "When the feedback is perceptibly automatic, it's just a message that only changes the person's name, I think it's horrible. But when it's feedback, for example, where they review [...] your technical challenge, it tells you what you did wrong, what you erred on. Then it's something completely different. - P00",
      "Man, I like to receive feedback. Regardless of positive and negative, most of the time this feedback doesn't exist, right? - P01",
      "the vast majority of times you'll just do an interview and that'll be it. Nobody will even tell you anything. - P01",
      "I like to receive feedback, whether positive or negative, but most of the time this feedback doesn't exist. In no way, neither written nor spoken. - P01",
      "regarding providing feedback, I think that, I don't know, most of the time, at the beginning, right, going through the beginning of the process, companies don't care about that [...] - P01",
      "And I think the improvement would be this, to make feedback a necessity, not to make it optional [...] but to provide feedback in a more humanized way if the candidate reached a certain stage [...] - P01",
      "The other companies just did the selection process, then I received an email saying I was approved or I received an email saying I was denied and it said I was approved because they liked me or that I was denied because they didn't like me, you know? [...] It was simply yes or no [...] - P02",
      "After the process ended, there was no more contact, no feedback. It didn't exist, it was simply, over. - P02",
      "Look, I think definitely yes, especially I suffered a bit from this [absence of feedback] when I was looking for an internship, because when you look for an internship, you are entering that market, you are there taking the first steps, crawling [...] - P02",
      "And then when a company fails to do that, it's kind of frustrating, right? Because you say, ah, why didn't I pass? Because I'm ugly? Because I'm handsome? Because my hair isn't like this, or like that? Because I forgot the semicolon at the end of the line of code? - P02",
      "Right, on the positive feedback issue, usually we are hired, so obviously everyone is very happy. But on the negative feedback issue, nowadays, as I'm telling you, I practically only receive automated messages [...] - P03",
      "[...] because I also haven't participated in any selection process for some months now. But sometimes putting it out there, for us to see the market thermometer how it is, I practically only receive automated messages, or we don't even receive messages anymore. - P03",
      "When, usually, when it's like: 'Ah, no, the vacancy didn't work out', at least what I've seen, right, like, the person says: 'Look, the vacancy was closed because we, like, it was canceled, the client didn't want it anymore, or because someone else was chosen in your place' [...] - P03",
      "It never happened to me, I have an ease of expressing myself well, conversing, anyway, I never had this problem. But, for example, with the recruiter, it would be interesting for the company to say: 'Look, you failed...', well, not with these words, but like: 'You fell short in your expression'. - P03",
      "You saying that: 'Ah, you seemed insecure'. Why are you insecure? In speech, in technology, in what? You understand? So, just be a little more specific and not so generalist. - P03",
      "Obviously, I've received those ones we see on LinkedIn. It's not a meme. We actually receive some, missing the company's name, I've received one. So, I think that's a huge lack of consideration for the candidate [...] - P04",
      "So, I didn't have problems with negative feedback, that left me... It's sad, okay, the only thing that makes me sad is this feedback, when you apply on the Gupy platform, [...] because they are automatic things and that bothers me - P04",
      "I think they should give feedback that is relevant to the candidate. That's it, improve those points. And not just say: 'Ah, you're not a fit... We won't proceed with you because you don't fit the profile, someone else fit the profile better.' - P04",
      "But why didn't I fit the profile? If I met all the requirements, is it something personal? They should specify the reasons, you see? Because then it's a way for you to improve for other interviews too. - P04",
      "I think companies have to provide more objective feedback, more objective, no, more personalized for each person, because today you, if you apply for a vacancy, they just say: ah, unfortunately you didn't advance in this selection process, but they don't say why you didn't advance [...] - P05",
      "It's important to have feedback, even if negative, explaining the reason for not proceeding with the application. It's important to have an answer, because in some processes the candidate is left not knowing... - P06",
      "Companies deal a lot with good practices. Even if it doesn't want to hire, it will give an OK, regular feedback to everyone there, you understand? And, mainly, selection processes with many candidates. - P07",
      "Not today. I don't take this feedback into consideration, because, as I said, it's not exclusive, it's general. Everyone is receiving that same message as me, so no. Whether it's positive or negative. - P07",
      "So, company feedback, generally, when we… So, clearer feedback, generally, when we pass a few stages. - P08",
      "Generally, when we apply and have the first meeting with the recruiter and don't pass, the feedbacks are practically automatic. So, we don't really have that… In my view, there isn't much concern… - P08",
      "Because currently recruiters have been sending more automatic feedbacks to users than a more personal feedback job. - P08",
      "I think the feedback… after the meetings still needs to improve, related to the user interface, but in the meetings we manage to delve deeper and understand that that point was for us, whether we have it or not. - P08",
      "I think the candidate… or receiving general feedback right away in the meeting, that would help a lot, not keeping that pressure of waiting for the return. I think when we do an interview, we are [with] a recruiter, in the interview itself I already have a brief notion [if] that user will continue or not with the application, so I think in the meeting itself, leaving it as... - P08",
      "When we receive feedback returns, mainly automatic ones, I already see that the recruitment part… should have a significant improvement with user returns. - P08",
      "Man, in general, in my own experience, the feedbacks I received were quite… how can I say… quite weak, like, speaking in the simplest word. [...] we decided not to continue [...] and basically that. - P09",
      "There was no very specific feedback that would allow me to verify at what point I ended up not meeting the requirement, or something like that. [...] I didn't get very clear feedback on the specific point. It was always very generic. - P09",
      "Man, these more generic ones, like, I rate them as terrible, okay? Because you, as a professional, if you are applying for a vacancy… you have the hope that you are doing a good job, right? - P09",
      "[...] if the company doesn't provide you with good feedback on why you weren't selected, or, for example, why you were selected [...] you end up being in doubt [...] - P09",
      "So, if you failed in the technical part, or you failed in the behavioral part. So, it ends up being a big problem, because you end up having the feeling of not having any evolution. - P09",
      "Since you didn't receive it, you can't identify this point. [...] whoever has already gone through these processes in the company, for sure, will speak ill of it because of this [...] - P09",
      "[...] for the professional, even worse, because they can't get this vision of what they should improve, for example. - P09",
      "[...] and describe specifically, for example, for those who didn't make it to the end of the process, at what point they ended up not being able to meet the needs of that vacancy. - P09",
      "I don't think it's very transparent. [...] a standard message is sent, formatted only with your name different and sent that you didn't pass to the next stage or that you weren't selected. - P10",
      "So, even if sometimes you meet all the requirements, at the tie-breaker moment, requirements are not very... Ah, you sometimes didn't even manage to meet a requirement, but it's for this specific reason. It's never specified. I think it's more of an internal company thing. - P10",
      "[...] the feedback, is a personalized feedback, because sending feedback just saying, look, you didn't pass this time, stay tuned, you're in the talent pool, like, it's kind of irrelevant, right, like, you don't have much to do. - P10",
      "I think better clarity on what the person was lacking would help, because many times, in LinkedIn searches or forums, people say to take the feedback and improve. But most feedbacks are standard, so they don't contribute much. - P11",
      "I received some, but ended up not going forward. What I received most was for the project I did with my professor, which I used as an internship. - P11",
      "Hard to say, because, as I said, most of my feedbacks were automatic. I didn't have feedback where the company really told me something. So I can't say. - P11",
      "we took all the resumes, put them in the system and saw that some didn't qualify. For these guys, it would be very good to be told: [...] you don't have, like, ah, the vacancy didn't work out and such [...] because you don't cover this time, right? Like, you don't have that much experience. - P12",
      "The most helpless you feel is about feedback on why you passed or didn't pass a phase. But that's not always necessary to disclose either. - P13",
      "the others that were a bit more regional, really… I didn't get a return message, even when I didn't pass. That was really complicated, really. I was just left hanging. - P14",
      "even if I hadn't passed, I wanted to have good feedback, you know? Then, like, I had to chase after it to find out - P14",
      "Yes, but usually it was… there was the in-person one, which wasn't exactly about the whole process, right? It was about the group dynamic. - P14",
      "the feedbacks I had, at least so far, were nothing related to technical aspects. [...] the ones I had were really more about… [...] they were less busy, had a connection or some reason, maybe, even better - P14",
      "through Gupy, I only receive an email, sometimes, saying I wasn't selected. The text, I think is practically the same for all companies that send it through Gupy. - P14",
      "So it ends up that for many people it becomes tedious, it becomes impersonal and it already becomes… well, just another one. It was just another selection process that didn't work out. - P14",
      "For example, giving feedback to eight people, depending on the HR that works with this, maybe it's too much. [...] they could have narrowed it down a bit more to be able to give more care to that person. - P14",
      "some emails even came with missing information, as if it had… like… “needed candidate, then candidate's name”. Sometimes my name wasn't even there. - P15",
      "I think this is something that is greatly lacking in companies nowadays, because you end up continuing somewhat blind to apply to other companies, you don't know what you're doing wrong, you don't know areas for improvement - P15",
      "minimally, I hope to receive a response that can add something. - P15",
      "I've asked before, but got no answer. So, I think it usually doesn't happen. - P15",
      "I believe they could point out these reasons, of course without hurting the person receiving this email, the person who applied for the vacancy. - P15",
      "what I could say is that feedbacks should be done genuinely and not just a: Unfortunately you cannot… you do not fit the vacancy. - P15",
      "at least for me, it's still not very clear how companies treat this, right? Because, many times, you don't fit… In most responses, it's that your profile won't fit, sometimes, also the company's culture. And this is also not clear. - P15",
      "I think the lack of feedback is what gives the most, like, not sadness, but... a feeling of: Geez, but why?. I just wanted... They ask so much for us to give feedback on the process and all... - P16",
      "So, feedback is what I miss the most. It's very automated, you know? These days, in fact, I received a no, like, for a vacancy, a long time ago that I had applied for, and my name was in brackets... - P16",
      "Even if, for example, I were rejected and I had this feedback, this more transparent thing, I would say: Wow, this company here is... – sorry, the word is awesome, because it's keeping me in the loop of what's happening - P16",
      "You weren't recruited because we found someone whose resume matches better – something like that. Then it's fine. But just the rejection isn't fine. I don't like that. - P16",
      "A lady from HR, she sent an email saying I hadn't been selected because someone else had 'matched better,' in quotes. And then, in the same email, in the body of the email, she said: If you have time... - P16",
      "And, even though it's more manual, a bit more annoying, it would be nice... I mean, to receive feedback from the company, right? And to give feedback, send that email to the person, or even make a call, as if it were an interview - P16",
      "Because, sometimes, you're counting on that, you think you passed, everything's fine, I'll start on Monday. Then the person comes and says you didn't pass. And then it's kind of frustrating. And I believe feedback, in this situation, would appease - P16",
      "At least say we don't offer feedback for rejected candidates. If you didn't receive feedback... Message received, understand? I don't know, something like that. Because this generates a lot of anxiety in those who are looking for a job, you know? - P17",
      "it was very difficult to receive feedback, you know? Okay, like, to be fair, go: like, I received more feedback from Gupy than in any other way, you know? Because Gupy itself rejects and says: well, we are closing the process here, and go with God, brother! - P17",
      "I've participated in a selection process where I did a technical challenge, and they rejected me. And I asked: look, I wanted to know the reason for the rejection [...] Then okay. Luan, we're going to put together a document here, and in a week we'll send it to you. [...] nothing - P17",
      "Sometimes the feedback is just, like: Luan, you were great, you were excellent, but there was Gabriel who was better than you, and we only had one vacancy, understand? So it's okay, man. You can't be the best at everything. - P17",
      "if there were critical points, if it fell short at some point, or if someone else was just better than you and demonstrated a better profile for the vacancy, understand? Or if you made some absurd mistake, like: man, I don't know, you committed a crime talking in the interview here. - P17",
      "Not being generic, you know? Trying to really pass on to the interviewee why they were not selected [...] Doing something personalized. - P18",
      "Definitely. It helps me be a more complete professional. When it goes to another side, that doesn't make me more complete, the feedback needs to be rethought. - P19",
      "When they start always giving feedback. There was a case where I never received a response. 'We are going to evaluate...' Whenever you do an interview, there's a report, a documentation, that emerges as feedback. - P19",
      "Sometimes responding, sometimes not, bothers me. - P19",
      "For the most part, it was not satisfactory. In many vacancies, the candidate does not receive feedback on what was missing to move to the next stage. There is no chance to improve later. - P20",
      "For example, 'lacked demonstration of knowledge in Java'. Six months later, I could return to the vacancy with this consolidated knowledge. This transparency is lacking. - P20",
      "The candidate ends up having to guess and create theories based on what they felt during the interviews. I had an interview last month and still haven't received a response. - P20",
      "Gupy, even though it's criticized, I see that today it tries to help the candidate more than the company. The problem is the lack of transparency, especially in demonstrating what the candidate did wrong and what they could improve. - P20",
      "Of course, not all companies are like this, some give feedback, but it's a small percentage. - P20",
      "I'm calm now, I took a lot of 'beatings' to get used to it. Most of the feedback I received was vague, just saying 'didn't pass, but don't be discouraged, your resume will remain in our database'. - P20",
      "I ended up getting used to understanding that 'return to the selection process' by email means negative feedback. But the few positive feedbacks I received were good for knowing what to study, where I went wrong, and what to do for the next vacancy. - P20",
      "Today there is doubt: what technology does the market want? Python? JavaScript? Apple development? Gemini API? Machine Learning? Data Science? Feedback helps the candidate to have a direction. - P20",
      "Make explicit why the non-hiring. If they didn't pass the screening, why? 'Because you have experience in Java and we want someone with Python'. It's blunt, but it's the reason. - P20",
      "'You need to improve your communication and we are looking for someone more communicative'. It's blunt, but it's the reason. A bonus would be to make explicit what the candidate got right. 'You demonstrated good knowledge of programming logic. We liked that'. - P20",
      "many times people use that Gupy platform, And in the email you receive the response, at the bottom, it says in bright orange that the company doesn't want you to reply to that email. - P21",
      "I would like to know, to have more feedback from companies, like, hey, why was I hired for that vacancy? What was the criterion used? Transparency about the process. - P21",
      "my dream would be for the company to give more feedback on this issue of not hiring. - P21",
      "I think companies could be a little more sensitive to see, hey, I've seen this resume more than once. [...] Let's give feedback - P21",
      "with more feedback, I think we can already take it and [...] know how to prepare the resume better for vacancies, because nowadays people make many resumes, you don't have one resume, you have several for several vacancies. - P21",
      "I think it would be good for the company the company would be much better regarded I think on these platforms where you evaluate companies, - P21"
    ],
    "T9": [
      "Look, I think it does influence, this communication influences a lot. But I've encountered so many cases of companies that didn't respond, that didn't give feedback, didn't comment on how the selection period was, they simply approved or rejected, that I ended up finding it kind of normal, you know? - P02",
      "And there have been others that I applied for and participated in the selection process and to this day I have never received any feedback. So, let's say it's average. Some are very good and others are very bad. They don't give the person an answer, no feedback at all. They don't even say if you passed or if you were rejected. - P05",
      "It can, for sure. When you apply to a company and you see they give no feedback at all, especially when you advance, have already advanced in the selection process, for me, I think it's the minimum the company can give, is feedback, even if it's, like, a bit more automatic [...] - P05",
      "When I see that a company gave no feedback at all, I don't even try anything with that company anymore, for another vacancy. - P05",
      "I think it's negative. Regardless of the answer, positive or negative, the company should provide a response. The candidate is left not knowing if they meet the job profile or not. Communication is fundamental. - P06",
      "When we receive feedback returns, mainly automatic ones, I already see that the recruitment part… should have a significant improvement - P08",
      "I removed from the list of companies I want to work for those companies that didn't get back to me at all. Anyway, this is very negative, okay? - P12",
      "Ah, it's like a talent pool. It's a completely generic thing. You'll never know if you're called. [...] So talent pools I have a bit more “little hate” for, I'm not such a fan. - P14",
      "but the people who are really progressing… advanced, received feedback, and you later just receive… the process ends and you just receive the email saying: unfortunately, we will not continue with your application. - P14",
      "But the ones that don't give feedback, the ones that, for example, just open there on Gupy, you send an email, you don't have much, you know? [...] I didn't create, at least, any emotional attachment - P14",
      "Most of the feedbacks I received, usually… about… This is a number from my head, of course, but I believe… They were automatic messages, which often didn't even really have a reason for my disqualification. - P15",
      "most of these had, like, common and generic responses, let's say, like: Oh, we're going to proceed with another candidate, and it doesn't really specify the reason why you were disqualified. - P15",
      "Of course, there it gives a series of ready-made answers for you to adapt and pass these parts of this process. But I believe this can happen, for example, if you are eliminated, it would be cool if the company said what points you got wrong there or what points would be more interesting. - P15",
      "Then, I don't know, to this day I haven't received a response, you know? So, it's complicated, man. I think the biggest cause of anxiety today is the lack of feedback, the lack of a... Transparency like that. - P17",
      "Firstly, as a candidate, I try to interpret signs, like a 'conspiracy theory'. I thought: 'I didn't pass because I said such a thing and the recruiter reacted in such a way'. - P20",
      "the process I think it would be cool if they gave a reason for you not having advanced I think that part would be awesome - P21",
      "In the fourth, I think, already reaching the fourth level [...] I think the company can come and, hey, look, because of this, you weren't selected - P21"
    ],
    "T10": [
      "As I've already mentioned, I find it unfair when there is no response, or when the vacancy demands more than expected for the level (junior, mid-level, or senior) and the salary does not match the requirements. - P06",
      "I think there was more of a disregard for having treated me like a robot, despite me having spent my time, and them having used a robot to say the same patterns to everyone, just altering the name. - P11",
      "some companies that really spoke, gave reasons… which were very few… This, I think, is highly valued for a future application you might have at the company, that you see the company really cares even about who it's disqualifying, wants to really see improvement and all that. - P15",
      "When you talk about justice, I think about the issue of whether the decision was really fair in relation to the candidate. I confess it's a difficult question to answer, because, in most processes, it's rare to have feedback on how the screening was done. - P20"
    ],
    "T5": [
      "And also on the technical part, when we receive feedback on the technical part. Saying that, like: 'Ah, your experience is little, in this point and that point, we expected you to know this and that,' you understand? Just be a little more technical, so the person already... 'Ah, gets it'. - P03",
      "For me, there are many activities that are really relevant, even if they are long. Sometimes we don't receive feedback, but they are relevant. - P11"
    ],
    "T4": [
      "Before how I react, I don't like it when it's kind of automatic. I think it's a huge lack of consideration for the candidate, because we dedicate time to research the vacancy, research the company. - P04",
      "I used to get quite upset. Nowadays, for me, it's just another no. As I said, the feedbacks are all standard. For me it's just another automatic message, it's like spam. - P11",
      "At least what I consider minimal is to get a response for that vacancy. [...] a good part of those I applied for [...] through third-party platforms [...] didn't get back to me, you understand, they didn't get back to me - P12",
      "the HR team was very helpful even when I contacted them later to find out if there would be a process… still… Because I was a bit frustrated because I had reached the end, passed everything, but when it came to… let's see, it wasn't… - P14",
      "I believe I didn't pass because I didn't know how to answer a question about clean code, but that's a guess. Nobody told me: 'Pedro, you didn't pass due to lack of knowledge in clean code and design patterns'. That's missing. - P20"
    ]
  },
  "AP09": {
    "T7": [
      "[...] sometimes we move on to talk to tech, and this recruiter passes it on to us, we have a cool vision. Now, like, when we talk to a recruiter and they ghost us, like, I don't even recommend that company anymore. I tell people: 'Look, I don't even look at anything from them anymore, you understand?' [...] - P03",
      "I rate it very poorly [communication with the candidate], at least most of the ones I participated in, the selection process was not very clear, they didn't make it very clear what they were going to, what they were going to consider at the time of your application, what was most important, if it was you having, I don't know, more soft skills, or if it was more important for you to have all - P05",
      "Yes. I've participated in selection processes where I felt that people were very, how can I say, very... harsh, perhaps, very, you could even say unfriendly, a very robotic thing. So, that already affects the person's decision, you start thinking: wow, what a place, the people are so cold [...] - P05",
      "There was a case of a selection process I participated in, where I was advancing, and, in the message to call for an interview, the woman, the HR employee, got my name wrong. - P07",
      "It's an indirect communication there, because, many times, the company doesn't even have… some platforms today, like Gupy and such, that you don't even reach a person directly. - P07",
      "[...] even if it's not GUPY, even if it's the company's institutional website, even if it's the application, it's a very dehumanized thing, it's something very cliché, right? It's that random message that you didn't pass, or that you passed [...] - P10",
      "[...] even when you pass, the message is very, like, neutral, you know? So, it's very much like, you feel a lack of human touch there, you know? There have even been situations, even in person, I've had, like, group dynamics, that I went to in person - P10",
      "[...] it was done via WhatsApp, the contact was more direct, but there was no proper contact. So, like, even if sometimes they try to get closer if it's not something well, like, thought out, what was supposed to bring closer ends up not bringing - P10",
      "[...] they have to convey professionalism, they have to convey interest, listen to the candidates, demonstrate that they are really looking for the ideal profile. There are companies that conduct interviews and it seems like it's a prompt there, that they are reading a prompt, you know? - P10",
      "So, I think it's important to convey interest, like, to convey that they are really looking for a person with that profile and to be attentive to people, right? Not just read something that's there on the slide and, like, it seems the process is kind of mechanical - P10",
      "And then they changed and only did the resume evaluation. There was no explanation, they changed at the last minute and we had to accept it. So, many times, there's a lack of clarity. - P11",
      "In most companies I see, it's just that robotic communication. There's no contact from someone saying: Look, you didn't pass because of this, this, and this. It's just a standard text, like: You passed to the next phase. - P11",
      "If there is no clear information about the process stages [...] I get a bit wary [...] I become indifferent to it. So that, if it works out, I… let's evaluate the next steps, but if it doesn't work out, I'm like, ah, okay - P12",
      "you perceive with the company's communication, depending on how the process is, if there's a group, if a WhatsApp group has already been created, if it's only by email, if it's only through the selection process platform, you already perceive the personality well, right? It's something that, depending on the way it's communicating with you, you see how organized and structured that company itself is, right? If it has mature processes and such. - P13",
      "Because if there are no more mature processes in selecting people to join, how will there be mature processes within the company, right? [...] the company's communication with me, with the person doing the selection process, normally greatly influences the way... how I think it will be within the company, you know. - P13",
      "they sometimes leave things very clear, sometimes they don't leave things clear, which you perceive in the transmission of their message, right? [...] look, here you will need to work a little harder at the beginning, you will have to have a very exclusive dedication - P13",
      "There were others that I had to… the application wasn't very clear. [...] And when I got there, we had to do a technical test, literally a test on paper - P14",
      "What ended up not being so clear, you know? It wasn't something that was explicit in the process, that there would still be a much more technical part, you know? - P14",
      "they sold themselves as a place that was taking great self-care with the people participating in the process and that they would have a “little feeling,” you know, of treating this. But it ended up kind of not happening. - P14",
      "the others that were really very impersonal during the process, that I got there, did the technical test, but it was something very cold, you know? [...] I already expected not to have that feedback - P14",
      "And the others were really forms, it was very impersonal. Then, usually, it was to evaluate from good to bad, the moments of dynamics and everything, and then the written feedback. - P14",
      "And for companies that really do something closer, more personal, I think it's really just a little more care. Maybe even narrow it down more. - P14",
      "It was very cold, it was very impersonal. It didn't seem like they were talking to potential colleagues, you know? - P14",
      "I missed some classes, because the interview was during class time… what else? It ended up that there was this test that kind of everyone who left it said they didn't feel they did well - P14",
      "Then everyone kind of felt the same way. And I was happy not to have been the only one. Then it was very cold, so I kind of already knew leaving there, like… ah, there's not much advantage for me to come work here. - P14",
      "it seemed like the companies really weren't caring about their process and how disqualified people feel about it. - P15",
      "So I think transparency matters a lot regarding the image and reputation as a whole, because if you get rejected due to a record issue and all that, don't receive even a minimal response, you will tell your colleagues and all that, this affecting the company's reputation in general and for future candidates too. - P15",
      "they try to have a... to say what the stages are, nicely, but we know that internally it changes, right, there isn't, sometimes they say they have a very well-designed process, but you can't advance in these phases - P18",
      "there were companies where in the recruitment and selection process itself, I ended up becoming, creating a network with the recruiters [...] there are other profiles that... So fuck you - P18",
      "I identified this point more in person with hunters [...] The ones that were, like, the conversation with the company's own HR [...] was where I had the best insights, the best conversations, and the best networks. - P18",
      "there are companies that will treat you like a person, there are companies that will treat you like a CNPJ number, a CPF there, especially for the PJ folks - P18",
      "That's why there are so many people promising the infallible method to pass selection processes, because there really is no clarity. And this comes from the companies, not the platforms. - P20",
      "Yes, because it shows what the company is like. If there was a lack of respect in the process, I already know that the company is probably not respectful. 'Show me who you walk with and I'll tell you who you are'. - P20",
      "If who represents me is disrespectful, I will think everyone is. If the person is kind and shows interest in helping, I will think everyone is like that. - P20",
      "I think there should be a person there who also looks at the resumes that are not being selected, so to speak. - P21",
      "everything comes from the clarity part of the company. [...] you will have a headache, as you already know the development team. - P21",
      "The company that will hire [...] in this back-and-forth business, will not have interaction with you. - P21",
      "recruitment company [...] it won't have a mea culpa because it will only be wanting to meet the need of the company that is hiring it. - P21"
    ],
    "T1": [
      "sometimes it's a long text that you can see is generated by artificial intelligence. - P18"
    ],
    "T3": [
      "So, I didn't have problems with negative feedback, that left me... It's sad, okay, the only thing that makes me sad is this feedback, when you apply on the Gupy platform, [...] because they are automatic things and that bothers me - P04",
      "Generally, when we apply and have the first meeting with the recruiter and don't pass, the feedbacks are practically automatic. So, we don't really have that… In my view, there isn't much concern… - P08",
      "Because currently recruiters have been sending more automatic feedbacks to users than a more personal feedback job. - P08",
      "I think the feedback… after the meetings still needs to improve, related to the user interface, but in the meetings we manage to delve deeper and understand that that point was for us, whether we have it or not. - P08",
      "When we receive feedback returns, mainly automatic ones, I already see that the recruitment part… should have a significant improvement with user returns. - P08",
      "Hard to say, because, as I said, most of my feedbacks were automatic. I didn't have feedback where the company really told me something. So I can't say. - P11",
      "So it ends up that for many people it becomes tedious, it becomes impersonal and it already becomes… well, just another one. It was just another selection process that didn't work out. - P14",
      "some emails even came with missing information, as if it had… like… “needed candidate, then candidate's name”. Sometimes my name wasn't even there. - P15",
      "So, feedback is what I miss the most. It's very automated, you know? These days, in fact, I received a no, like, for a vacancy, a long time ago that I had applied for, and my name was in brackets... - P16",
      "I mainly evaluate if it was someone who wrote it or if it was a machine that wrote it. And, even when it was a machine that wrote it, I see if there's any relevant information for me to take for my life... - P16",
      "many times people use that Gupy platform, And in the email you receive the response, at the bottom, it says in bright orange that the company doesn't want you to reply to that email. - P21"
    ],
    "T9": [
      "Ah, I think that… Especially if the person is unemployed, waiting for results, because sometimes they depend on feedback. I find it very absurd. I think you have to have this… You have to have this responsibility, [...] - P04",
      "So, I think this discourages the person. If I'm participating in a selection process, and the company doesn't make clear what the next steps are, most of the time I question, after this conversation, what will it be? And if the company there doesn't, most of the time I also send a message, sometimes an email [...] - P05",
      "For me, a company, when it takes a long time, when it doesn't make the selection processes clear, the impression I get is that it's a very disorganized company, a company that isn't concerned with relaying information to the candidate, leaving it clear. So, that already gives me a bad image of the company. - P05",
      "I can't put six hundred people through a selection process just to send automatic messages to everyone, that's it. If I want comfort, if I want to show I'm a serious company. - P07",
      "When we receive feedback returns, mainly automatic ones, I already see that the recruitment part… should have a significant improvement - P08",
      "when I don't have clear information about the step-by-step of the process, I wait. Now, I expect to be notified, at least. [...] if they don't get in touch, you quickly get in touch to say, hey, I'm here, I'm alive, so, what's the status? - P13",
      "But the ones that don't give feedback, the ones that, for example, just open there on Gupy, you send an email, you don't have much, you know? [...] I didn't create, at least, any emotional attachment - P14",
      "Most of the feedbacks I received, usually… about… This is a number from my head, of course, but I believe… They were automatic messages, which often didn't even really have a reason for my disqualification. - P15",
      "This lack of clarity generates distrust and leaves the candidate insecure. - P20"
    ],
    "T2": [
      "most are Gupy, right? [...] I had three jobs [...] none of them I went through Gupy. And I don't know anyone who went through Gupy. But most of the processes I participated in were through Gupy, and I had no feedback, you know? - P17",
      "Then, sometimes, the feeling I get on Gupy is of... of being erased, you know? Of not being seen at all, as if nothing on your resume really mattered, because they don't see your resume there. - P17"
    ],
    "T10": [
      "When the company has a bad process, right, like, doesn't have much respect, I don't apply for that vacancy anymore and usually I don't recommend it. - P03",
      "If there's a question like: “What's your mother's name?”, I'm like: “What's the need for this?”. Or: “What's your CPF [Brazilian Tax ID]?”. I'm like: “Why do I have to give my CPF here already?”. If it's just for registration, I usually don't even continue, I stop there. - P11",
      "I think there was more of a disregard for having treated me like a robot, despite me having spent my time, and them having used a robot to say the same patterns to everyone, just altering the name. - P11",
      "some companies that really spoke, gave reasons… which were very few… This, I think, is highly valued for a future application you might have at the company, that you see the company really cares even about who it's disqualifying, wants to really see improvement and all that. - P15",
      "Some do this, but I believe that most there… many people end up getting a “no” because they don't have a referral, don't have a very strong network there with someone from the company. - P15",
      "But the feeling I have is of strangeness when information like this appears, because, usually, they don't say what this data is for, where this data goes, but they just ask. - P15",
      "So, I believe it would be strangeness, insecurity, and a strong indication that I will not continue in this process. - P15",
      "the feeling is this of invisibility. - P17",
      "If there's nothing exceptional, a lack of respect, I try to understand if my profile fills the vacancy. But that's me speaking after having done Civil Engineering, in my second degree. - P19",
      "When the company gives a feeling of lack of transparency, and does not act according to what it preaches, this affects a lot. Many companies highlight transparency in their profiles, but, in practice, this ends up not happening. - P20"
    ],
    "T5": [
      "Because like, for example, if you're going to take a test, someone gives you the content and tells you what it is, you understand? And programming is broad, so you saying: 'Ah, there will be a technical test,' and not telling you absolutely anything about what the technical test is about, obviously you see it has a very large scope [...] - P03",
      "There's no way you can prepare for something you don't know. Like, that you don't know the scope. It's not that you don't know how to program. You don't know the scope of everything. You understand? - P03",
      "Okay, there was one I participated in, which I found strange, but okay, I was a little scared when I entered the room, when I saw the invitation, because there were five people. [...] Then when I entered, they introduced themselves, [...] - P04",
      "[...] sometimes you make a mistake on something you already know. And then it gives that image that you don't know, but sometimes you don't even make a mistake. It's more the nervousness of doing that with that certain pressure. - P10"
    ],
    "T4": [
      "Before how I react, I don't like it when it's kind of automatic. I think it's a huge lack of consideration for the candidate, because we dedicate time to research the vacancy, research the company. - P04",
      "I don't have a uniform view on this, because I think each company behaves differently with candidates, but the vast majority, especially remote vacancies, it's that issue, [...] it's a very dehumanized thing [...] It's that random message that you didn't pass, or that you passed [...] - P10",
      "I used to get quite upset. Nowadays, for me, it's just another no. As I said, the feedbacks are all standard. For me it's just another automatic message, it's like spam. - P11",
      "So, if the criteria are not transparent… That's not cool. And my perception is this. The criteria used during the evaluation of applications are not clear. It's not clear. The clarity is not good enough. It's not sufficient to understand how they will be evaluated [...] I had to look for it from another source. I had to look for it from other people who have already been through here - P12",
      "The practice of transparency... Maybe it's not clear even to them. About 40% of the interviews I did were transparent, most were not. - P19"
    ]
  },
  "AP14": {
    "T7": [
      "[...] sometimes we move on to talk to tech, and this recruiter passes it on to us, we have a cool vision. Now, like, when we talk to a recruiter and they ghost us, like, I don't even recommend that company anymore. I tell people: 'Look, I don't even look at anything from them anymore, you understand?' [...] - P03",
      "Interview, generally, we do an interview with the recruiter and after a month we get a response saying there will be another interview, by then, in the meantime, you've completely lost interest - P08",
      "Man, generally, when the company takes a long time, for example, to give a return, or we see that you send, sometimes, an email wanting to know more information about the process, and people don't respond [...] - P09",
      "There were companies I tried for, the process was cool, they accepted me [...] And there were companies where I went through the process, the process wasn't cool, or they didn't give me feedback [...] I was already working [...] I don't accept - P12",
      "the others that were really very impersonal during the process, that I got there, did the technical test, but it was something very cold, you know? [...] I already expected not to have that feedback - P14",
      "I think if it could bring some useful information, it would be like... average response time, I don't know, a month, two weeks, you know? [...] Because I've known people, including, who were hired, who were approved in a selection process six months later - P17"
    ],
    "T3": [
      "After the process ended, there was no more contact, no feedback. It didn't exist, it was simply, over. - P02",
      "So, company feedback, generally, when we… So, clearer feedback, generally, when we pass a few stages. - P08",
      "I think the candidate… or receiving general feedback right away in the meeting, that would help a lot, not keeping that pressure of waiting for the return. I think when we do an interview, we are [with] a recruiter, in the interview itself I already have a brief notion [if] that user will continue or not with the application, so I think in the meeting itself, leaving it as... - P08",
      "the others that were a bit more regional, really… I didn't get a return message, even when I didn't pass. That was really complicated, really. I was just left hanging. - P14",
      "even if I hadn't passed, I wanted to have good feedback, you know? Then, like, I had to chase after it to find out - P14",
      "I received very… informal feedback, because I was the one who chased after it. - P14",
      "I've participated in a selection process where I did a technical challenge, and they rejected me. And I asked: look, I wanted to know the reason for the rejection [...] Then okay. Luan, we're going to put together a document here, and in a week we'll send it to you. [...] nothing - P17",
      "When they start always giving feedback. There was a case where I never received a response. 'We are going to evaluate...' Whenever you do an interview, there's a report, a documentation, that emerges as feedback. - P19",
      "The candidate ends up having to guess and create theories based on what they felt during the interviews. I had an interview last month and still haven't received a response. - P20"
    ],
    "T9": [
      "Because, right, you're there dedicating your time, wanting to progress at some point and then you... blackout, right? It seems like the company ceased to exist, canceled its CNPJ [tax ID], right? - P02",
      "[...] and sometimes when we respond, they [recruiter] ask what your salary intention is, what technologies you know, this and that, we pass this to them and they simply disappear. Most don't give you any response. - P03",
      "There was another example too, of this one that contacted me, I replied: 'Hey, can we schedule a time? I have a certain hashtag, x salary would be interesting'. I think they replied on WhatsApp, the contact was via WhatsApp, they replied on WhatsApp, I think two months later [...] - P03",
      "[...] when I saw the message I didn't even know what it was about, then I thought about it, I remembered what it was, what it was about, just to show you the level. So, I'd say this communication is very bad. - P03",
      "To know information. Things like that. I simply abandon it. Because it can be for two reasons: either it's really a very bad process. Or they ended up finding someone else and do that, you understand? Like, if I'm a recruiter and I'm talking to three people, and I immediately ghost you [...] - P03",
      "[...] or I don't answer your responses well... it's because probably... responses no, I don't answer your questions, probably among the three there that I was mapping, one already satisfied and already closed the vacancy and that's it, you understand? - P03",
      "Yes, yes. I only had one problem, I only participated in five interviews, not many. But I only had a communication problem in one. They took a long time to give me feedback. - P04",
      "And it ended up that I got in touch and I was disappointed, because I did the whole process, and they took too long, like, it was a month to answer me, for the new phase to come. - P04",
      "And there have been others that I applied for and participated in the selection process and to this day I have never received any feedback. So, let's say it's average. Some are very good and others are very bad. They don't give the person an answer, no feedback at all. They don't even say if you passed or if you were rejected. - P05",
      "It can, for sure. When you apply to a company and you see they give no feedback at all, especially when you advance, have already advanced in the selection process, for me, I think it's the minimum the company can give, is feedback, even if it's, like, a bit more automatic [...] - P05",
      "When I see that a company gave no feedback at all, I don't even try anything with that company anymore, for another vacancy. - P05",
      "I think this point is the same one I even commented on, which was related to this delay in information return… that impacts, mainly, if we are in doubt or not if we will leave the current company. - P08",
      "So, I've had my own experiences, mine and my colleagues', where we practically applied for a vacancy, and then we didn't get any feedback, if we were accepted, if we weren't accepted. It's still there to this day [...] - P09",
      "[...] due to communication failure, the company ends up losing a good professional because there's no correct feedback, and then the professional goes and looks for another vacancy, for example, because they couldn't get feedback from this other one. - P09",
      "there was a process here that I had to call the recruiter to find out when the result would come out, you know? Because they said a date, it had already passed the date, about two days, then I spoke to her, because I wanted to know. - P14",
      "It impacts a lot, because it will affect the view I have of the company. [...] I just had to kind of chase after feedback. It's not a bad company, because the whole process was very comfortable, it was very good, actually. - P14",
      "Then, I don't know, to this day I haven't received a response, you know? So, it's complicated, man. I think the biggest cause of anxiety today is the lack of feedback, the lack of a... Transparency like that. - P17",
      "nobody shows up, nobody shows up, nobody shows up, a week, two weeks, three weeks... And another colleague of mine who was in another group said: Luan, the dynamic has already happened, I was approved, you know? [...] they didn't give us any feedback - P17",
      "This made me paranoid, wondering if something I said eliminated me. Today I'm calmer, but, for a period, I was very anxious. - P20"
    ],
    "T4": [
      "Most of the time, like, for example, it happened to me: I was applying for some vacancies a while ago and I left my cell phone off. Then I received contact from two recruiters. One simply didn't even bother to answer me anymore [...] - P03",
      "At least what I consider minimal is to get a response for that vacancy. [...] a good part of those I applied for [...] through third-party platforms [...] didn't get back to me, you understand, they didn't get back to me - P12"
    ]
  },
  "AP19": {
    "T7": [
      "Mainly on Gupy, where, when you apply for a vacancy there, you apply already putting all possible keywords, all very well arranged, but you are not selected. - P04",
      "Because, for example, sometimes I applied for vacancies where I had all the technical qualifications and it didn't work out. So, I was kind of like, why didn't it work out? Where did I go wrong, since I received very good technical feedback, at least. So, I think sometimes it's not very clear what they are taking into consideration - P05",
      "Mainly when we end up asking about parts, like, either more technical, or more structural, or more cultural aspects of the company, and the recruiter kind of tries to push that content to the next meeting - P08",
      "I find the criteria often flawed, without clarity. [...] You don't see a criterion. [...] many times they don't bring clarity as to why you didn't pass. - P11",
      "And then they changed and only did the resume evaluation. There was no explanation, they changed at the last minute and we had to accept it. So, many times, there's a lack of clarity. - P11"
    ],
    "T1": [
      "This is annoying, because if the person is looking for a salary improvement, they could avoid wasting time. I've been through an entire process thinking the salary would be Y and the company offered X. It was a waste of time for both. - P20"
    ],
    "T3": [
      "So, when I participated in the selection period and I, I don't know, don't have a clear answer as to why I was approved or not, I just got used to it, you know? So, I find it weird, but for me, at least, it became somewhat normalized. - P02",
      "[...] so I think more important than the feedback that you passed is feedback on why you were rejected. Because then you can learn from it and maybe improve in some way for the next selection process that comes along. - P02",
      "But why didn't I fit the profile? If I met all the requirements, is it something personal? They should specify the reasons, you see? Because then it's a way for you to improve for other interviews too. - P04",
      "It's important to have feedback, even if negative, explaining the reason for not proceeding with the application. It's important to have an answer, because in some processes the candidate is left not knowing... - P06",
      "There was no very specific feedback that would allow me to verify at what point I ended up not meeting the requirement, or something like that. [...] I didn't get very clear feedback on the specific point. It was always very generic. - P09",
      "[...] if the company doesn't provide you with good feedback on why you weren't selected, or, for example, why you were selected [...] you end up being in doubt [...] - P09",
      "[...] and describe specifically, for example, for those who didn't make it to the end of the process, at what point they ended up not being able to meet the needs of that vacancy. - P09",
      "So, even if sometimes you meet all the requirements, at the tie-breaker moment, requirements are not very... Ah, you sometimes didn't even manage to meet a requirement, but it's for this specific reason. It's never specified. I think it's more of an internal company thing. - P10",
      "we took all the resumes, put them in the system and saw that some didn't qualify. For these guys, it would be very good to be told: [...] you don't have, like, ah, the vacancy didn't work out and such [...] because you don't cover this time, right? Like, you don't have that much experience. - P12",
      "I believe they could point out these reasons, of course without hurting the person receiving this email, the person who applied for the vacancy. - P15",
      "what I could say is that feedbacks should be done genuinely and not just a: Unfortunately you cannot… you do not fit the vacancy. - P15",
      "at least for me, it's still not very clear how companies treat this, right? Because, many times, you don't fit… In most responses, it's that your profile won't fit, sometimes, also the company's culture. And this is also not clear. - P15",
      "Even if, for example, I were rejected and I had this feedback, this more transparent thing, I would say: Wow, this company here is... – sorry, the word is awesome, because it's keeping me in the loop of what's happening - P16",
      "Because, sometimes, you're counting on that, you think you passed, everything's fine, I'll start on Monday. Then the person comes and says you didn't pass. And then it's kind of frustrating. And I believe feedback, in this situation, would appease - P16",
      "it was very difficult to receive feedback, you know? Okay, like, to be fair, go: like, I received more feedback from Gupy than in any other way, you know? Because Gupy itself rejects and says: well, we are closing the process here, and go with God, brother! - P17",
      "I've participated in a selection process where I did a technical challenge, and they rejected me. And I asked: look, I wanted to know the reason for the rejection [...] Then okay. Luan, we're going to put together a document here, and in a week we'll send it to you. [...] nothing - P17",
      "Sometimes the feedback is just, like: Luan, you were great, you were excellent, but there was Gabriel who was better than you, and we only had one vacancy, understand? So it's okay, man. You can't be the best at everything. - P17",
      "if there were critical points, if it fell short at some point, or if someone else was just better than you and demonstrated a better profile for the vacancy, understand? Or if you made some absurd mistake, like: man, I don't know, you committed a crime talking in the interview here. - P17",
      "When they start always giving feedback. There was a case where I never received a response. 'We are going to evaluate...' Whenever you do an interview, there's a report, a documentation, that emerges as feedback. - P19",
      "For example, 'lacked demonstration of knowledge in Java'. Six months later, I could return to the vacancy with this consolidated knowledge. This transparency is lacking. - P20",
      "Gupy, even though it's criticized, I see that today it tries to help the candidate more than the company. The problem is the lack of transparency, especially in demonstrating what the candidate did wrong and what they could improve. - P20",
      "I ended up getting used to understanding that 'return to the selection process' by email means negative feedback. But the few positive feedbacks I received were good for knowing what to study, where I went wrong, and what to do for the next vacancy. - P20",
      "Make explicit why the non-hiring. If they didn't pass the screening, why? 'Because you have experience in Java and we want someone with Python'. It's blunt, but it's the reason. - P20",
      "I would like to know, to have more feedback from companies, like, hey, why was I hired for that vacancy? What was the criterion used? Transparency about the process. - P21"
    ],
    "T9": [
      "Wow, I think it's hard to analyze that, right? Criteria for... Because the vacancies, you see that you fit all the points, but you're not selected. - P04",
      "Most of the feedbacks I received, usually… about… This is a number from my head, of course, but I believe… They were automatic messages, which often didn't even really have a reason for my disqualification. - P15",
      "most of these had, like, common and generic responses, let's say, like: Oh, we're going to proceed with another candidate, and it doesn't really specify the reason why you were disqualified. - P15",
      "Firstly, as a candidate, I try to interpret signs, like a 'conspiracy theory'. I thought: 'I didn't pass because I said such a thing and the recruiter reacted in such a way'. - P20",
      "the process I think it would be cool if they gave a reason for you not having advanced I think that part would be awesome - P21",
      "In the fourth, I think, already reaching the fourth level [...] I think the company can come and, hey, look, because of this, you weren't selected - P21"
    ],
    "T10": [
      "I was treated fairly in all the processes I participated in. But then there was this one where they asked a question that didn't fit the nature of the work. - P04",
      "So, like, besides putting those data, for you to put there, it doesn't say what they will do with those data. [...] Obviously, they will look for some criminal record, something that, like, they shouldn't be looking for without telling you - P10",
      "When you talk about justice, I think about the issue of whether the decision was really fair in relation to the candidate. I confess it's a difficult question to answer, because, in most processes, it's rare to have feedback on how the screening was done. - P20"
    ],
    "T4": [
      "So, if the criteria are not transparent… That's not cool. And my perception is this. The criteria used during the evaluation of applications are not clear. It's not clear. The clarity is not good enough. It's not sufficient to understand how they will be evaluated [...] I had to look for it from another source. I had to look for it from other people who have already been through here - P12",
      "the HR team was very helpful even when I contacted them later to find out if there would be a process… still… Because I was a bit frustrated because I had reached the end, passed everything, but when it came to… let's see, it wasn't… - P14",
      "It's not transparent. The criteria should be aligned with some company problem. - P19",
      "The practice of transparency... Maybe it's not clear even to them. About 40% of the interviews I did were transparent, most were not. - P19",
      "I believe I didn't pass because I didn't know how to answer a question about clean code, but that's a guess. Nobody told me: 'Pedro, you didn't pass due to lack of knowledge in clean code and design patterns'. That's missing. - P20"
    ]
  },
  "AP02": {
    "T7": [
      "Basically, that's what I see, I see that many processes are confusing. Few companies make it clear in the description what they really want. - P05",
      "There were others that I had to… the application wasn't very clear. [...] And when I got there, we had to do a technical test, literally a test on paper - P14",
      "I understand that the manager doesn't have this job of 'selling' the company, they want to understand if the candidate is ideal for them, but this also makes it difficult for the candidate, who returns to that point of clarity about what they will do day-to-day, where they will spend the next few years. - P20"
    ],
    "T1": [
      "I think what's in that information has to be very objective things about the job. [...] And even more important is being able to see reviews from people who have already participated. - P00",
      "There. I assess that it's important for them to be extremely descriptive, as I had mentioned before. If you are looking for a professional who works with X technologies, [...] you need to have all these things described. - P00",
      "Many descriptions are somewhat controversial, because it seems like people from the field didn't write them, or, I don't know, they're just saying that to weed out candidates, the vast majority of these vacancies. - P01",
      "it was a vacancy that required, for front-end it required, React, Vue, and Angular, and for back-end it was requiring Go, Java, and C Sharp. It doesn't even make sense [...] - P01",
      "to improve ads, to improve employee expectations, it would be a more cohesive point, to put more objectivity in the ads, specific technologies, salary, company. - P01",
      "Look, I've read some, I don't know, quite a few job descriptions. And usually, for us who theoretically work with something a bit more technical, I find it very generalist. So, like, it says web development. But what is web development, you know? What language? What stack? Is it legacy? Is it not legacy? - P02",
      "[...] about four, no, but about three or two are, like, intermediate, and one or two are practically, you don't understand what the vacancy is asking for, you understand? - P03",
      "Be it the technology, be it what you will perform, but mainly the technology, sometimes it's not described very well. - P03",
      "So, I would say that regarding benefits, the work regime, I would say that there only about four are well described, the rest are average to poor. - P03",
      "But I think that, having clarity about this, having clarity about the benefits. And about the technologies that are actually used in... are used in that vacancy, because when, sometimes, there are several things, then we: 'Okay, we go there and it matches [...] - P04",
      "[...] with everything, check everything', but when we join, we don't even use half of that, like: 'Ah, automated tests using tool x', when you join, sometimes it's just functional tests, that you see automation [...] - P04",
      "[...] they give you there... There's no reason for you to just study for, if by chance, in the future, you need that, you know. You see? I think that breaks the candidate a lot too. I think they should specify that better. - P04",
      "Today, at least in the experiences I've had, I feel there are vacancies that demand a lot, and when you advance in the selection process, you see that the company required technology they don't even use, nor plan to use in the future. - P05",
      "I see many companies requiring automation tools, but when you get to the end of the selection process they say: we don't automate yet, it's something for the future. - P05",
      "Although I've seen vacancies, for example, mid-level vacancies, that paid a junior salary. And I only found this out at the end of the hiring process. - P05",
      "The technology that, in fact, they will use. I think some companies list a lot of things and they won't even use them. This has to be clear. You have to really demand what you will use. - P05",
      "Because, many times, the person has all the requirements that the vacancy will actually use, but they don't apply because they are asking for a lot of things. So, I think that's complicated. - P05",
      "Ah, another thing too, I see many companies that list the vacancy as remote, but, for example, it's remote, but you have to be here in the state of São Paulo, because once a month you have to come to the office, so that no longer fits the telework model, so this has to be clear, if you have to be at the office recurrently. - P05",
      "No, [information] is not provided clearly. Often it's confusing, sometimes it's not even provided. When it is provided, it's in a very superficial way. They don't detail it much. - P05",
      "I think companies need to be more direct. Sometimes you see a job ad and there are a thousand and one pieces of information. I think when the text is more concise, it's easier for you to understand. It's better for companies to make the whole process more objective. - P05",
      "Clarity is fundamental. What is written there should be what the company actually requires. But, for example, in junior positions, I sometimes see a higher demand than there should be, with many requirements... - P06",
      "This part I see is more summarized, I think the candidate needs to research more to understand what the company does, what service it provides, etc. - P06",
      "I think they could improve on the requirements for the vacancy. They could be more specific, better divide the expectations for junior, mid-level, and senior. - P06",
      "I think today the market is very generalized. There are many companies that advertise these vacancies, these descriptions in a very generalized way. - P07",
      "It's no use generalizing, as I said, putting various things in a very broad way. I think it has to be more minimalist. And, whether you like it or not, actually bring, as much as possible, the day-to-day routine [of the employer]. - P07",
      "Sometimes, you find it difficult even to know the work format, whether it will be hybrid, in-person, or one hundred percent home office. - P07",
      "The interviews and participations I have, practically one hundred percent, are home office, so they were more online interviews, mainly interviews I came into contact with through LinkedIn. [...] sometimes, very broad information and, sometimes, information about vacancies that don't provide much detail [...] - P08",
      "They put home office, but at the time of the interview, many times, they say it's hybrid, that you have to, once, twice, [go to the office], they consider the vacancy as if it were home office. Sometimes, they are leaving this clarity a bit… doubtful in the job descriptions - P08",
      "Talk a bit too [...] about the structural issue itself, talk about how the team works, if it's a team… if the vacancy is for a specific client in the company, if they are already looking for this, will act... - P08",
      "Man, in the vacancies I've been seeing and following, usually, people give a somewhat generic description, sometimes, too much. Or else, they put a lot of things. [...] specifically for the development area, sometimes, you see a very long list of requirements [...] - P09",
      "[...] they ask for ten requirements, but in the end, they only really use two in the company, you understand? So, that's one of the points I've seen. - P09",
      "And, sometimes, lack of clarity. [...] they don't talk much about the expectation for the professional, what the qualifications would be, what they would do on a daily basis. [...] or there's too much unnecessary information, or, sometimes, information is missing. - P09",
      "[...] if I have a list of requirements, and there are requirements for back-end, front-end, and mobile, [...] but they don't specifically explain what the person will work on, for the most part. - P09",
      "They don't give a very general context of what the company does. [...] perhaps, a slightly better description of what the person will work on. - P09",
      "Man, they are clear, but it's that very summarized clear, you understand? It's not something very specific, which actually ends up not being clear. [...] we end up being a bit in doubt. - P09",
      "Man, from the points I see, the issue of more general information, maybe specifying a bit more, describing the vacancies better. - P09",
      "[...] vacancies that are three different positions in the same vacancy, a seniority, for example, entry-level, which is an internship with a requirement of proven experience. - P10",
      "[...] sometimes, the lack of perception of seniority or requirement, you know, with the budget for that vacancy, or many times there isn't even a budget to know, right, you only find out at the end of the process, that's also a problem - P10",
      "[...] due to lack of technical knowledge of that position, information is lacking. Not for lack of will to make something complete, but for lack of understanding of how that vacancy works - P10",
      "It's a very large detail, as if the person were going to use all of that. Sometimes, I open a Junior vacancy and it says I'll have to work with Java 8, Java 17, Docker, Kubernetes, AWS - P11",
      "I see a lot of this, throwing in a bunch of technologies. In contrast, when I look at a Mid-level or Senior vacancy, I perceive a difference. [...] It's more like: I want you to have experience with Java, Spring, database - P11",
      "It's very complicated, I understand the company's part in trying to show what a junior person is. They can say they want someone with knowledge in certain technologies, but who measures this knowledge? How can you measure it? - P11",
      "Yes. I notice that many descriptions, especially those on hiring platforms like Gupy, platforms used by small and medium-sized companies [...] have a lot of difficulty with descriptions [...] they don't display information [...] about what the minimum and maximum salary range for that vacancy might be - P12",
      "Usually it's like this: the vacancy is for this, you need these requirements and you will have an advantage if you have these requirements. Usually it's like that, but contextualizing a bit more would be very good, describing, besides what the day-to-day would be like, in what context will you work? - P12",
      "Responsibilities, I think that's one of the main ones, right? What you will do when you get there. Location, what is the work regime, right? If it's in-person, hybrid, online. [...] especially what the location is if it's in-person, you know, to consider - P13",
      "I can… I even find the information that comes quite clear, at least for the vacancies I got to see, but they are very… how can I say… There's a lot of information there. - P14",
      "In most cases, the people who are starting out, which was my case, and I still see this a bit more in the market, don't have all those requirements, don't have all those skills. The demands that appear go a bit beyond what a person normally considers they have. - P14",
      "It covers a lot, but it's not exactly all of that at the moment, you know? - P14",
      "Like, thirty requirements there? No, I don't have them. At least in my head, I already put it that I can't pass, so I end up not even trying. - P14",
      "Mainly the requirements, which I think are what gets most people, gets me more [...] about two, three years of experience that you have to have [...] and some other quantity – very large – of technologies (large for those who are starting, right?) - P14",
      "It could be a little leaner, so that the actual duties people will have in the role match the requirements more. - P14",
      "Ah, you need to have knowledge of this language. This language will be worked on in this, this, this, in your role. [...] I believe it would make it clearer for those who are going to apply. - P14",
      "the duties we discussed there on the day [...] were practically junior duties, not those of an intern. - P14",
      "when I left the process, talking to the other candidates, everyone there kind of agreed that… because that internship vacancy was practically a junior and didn't pay well - P14",
      "The duties were excessive for the role, the remuneration wasn't sufficient… mainly, I think this was the process I was most disgusted with - P14",
      "they ask for mobile, front-end, and back-end technologies at the same time, without specification. - P15",
      "sometimes it also happens that there's little description, almost nothing of what is being asked. - P15",
      "You apply for the vacancy and end up getting feedback that your technologies are not compatible with the vacancy, when the vacancy didn't even show which technologies would be necessary - P15",
      "it depends a lot on the company itself. I believe most do present most of this information, but, often, not very clearly. - P15",
      "I believe that if companies could put a series of more common questions, that people applying have more common questions, they can put them there, put answers. - P15",
      "Often there isn't... for example, the vacancy is hybrid, but it doesn't say how many times you have to be present in the office. - P15",
      "also the issue of how it is… how the company works. If it works remotely, what does it use to work? Does it use Teams? Does it only use Zoom? Does it have a specific platform? Methodology issues, if they use Scrum, do they use something else, XP… - P15",
      "I feel there's a certain lack in that information. Okay, we have the tools we need to know and all, but it's kind of just thrown in there, you know? - P16",
      "sometimes, the person who makes these job ads puts that the person needs to know Node. But the person doesn't need to know Node, right? - P16",
      "Lack of clarity in the specifications a person needs to have, you know? Or even levels: junior, mid-level, senior. - P16",
      "I've come across vacancies, like, that were absurd in what they wanted. It even matched the salary, for example, but they were absurd in what they wanted for the level they were asking for. So, it was a junior who had to have senior experience - P16",
      "What will I actually do in this job? What are, in fact, the tools I will use in this job? What does my level of knowledge in this tool need to be? - P16",
      "Specify if it's remote or in-person or hybrid, because, as funny as it may sound, I've come across vacancies on LinkedIn where the person was putting there: Work model: to be discussed. What do you mean, to be discussed? - P16",
      "About tools, as I told you in the first question, I think there's still a certain lack of clarity. About salary, there's no clarity on that, zero. Sometimes, very few vacancies show this information. - P16",
      "I think it's essential to have someone from the department, or someone who fulfills that role within the company, helping to put together these aspects of the... ad, so we can be more certain. - P16",
      "But I think that, sometimes, HR people don't have much of an idea of what they're writing there. And they're either asking for too much, or things that aren't necessary, but because they read it somewhere, they think it's cool - P16",
      "there are companies that are not focused on technology, but have a technology sector. Then usually the person who writes the vacancy is a non-technical person, and the vacancy will be like that, right? Experience in computer languages [...] eighty languages - P17",
      "I think describing the activities well. [...] Web developer, you know there are a million different ways to be a web developer. Then, sometimes, I've seen vacancies with, like, you have to have Angular, React, [...] that are not in the same project - P17",
      "I think most today, yes, you know? But you find many vacancies in that first model I told you about, about a non-technical person writing the vacancy, you know? Then usually you will be the IT guy. - P17",
      "Some companies detail it very well, it's very clear there. [...] some have a very vast description. Now there are others that are very poor [...] you can't get any insight into what the vacancy is, what they are asking for - P18",
      "today I might be a mid-level in my business rule, which is in my current company, but, like, depending on where I'm going [...] I would very likely go back to a junior level [...] if they don't make it explicit there what they want in the vacancy, it's something very generic - P18",
      "sometimes it's a long text that you can see is generated by artificial intelligence. - P18",
      "it can lead to social issues, not everyone is used to or has the discernment to interpret the text that people put there in the application, you know? - P18",
      "Difficult, because whoever posts the vacancy, often, doesn't have the technical knowledge to filter [...] they ask for five years of experience in FastAPI, a framework created in 2020. The creator of the tool wouldn't be able to pass the vacancy! - P19",
      "Either you have to be a superhero to learn everything, or it's an illusory vacancy. [...] There are many complicated ads, with unprofessional descriptions. I've seen 'we don't like whining'. Then they change the ad. - P19",
      "I think it goes through them knowing what problem they want to solve. If they don't know, the vacancies will be generic. - P19",
      "Defining the problem better is the main thing. If the problem is cloud computing, you need a cloud engineer or architect. From there, define languages, libraries. - P19",
      "If I see requirements that don't make sense, I have difficulty knowing if they have a problem to be solved. [...] If I say: I have this problem in data science [...] For that, you don't use Java, you use Python. - P19",
      "An implicit prerequisite for the vacancy I got was communication. They are foreigners. They require Spanish, English, but were looking for someone who communicated well in Portuguese. - P19",
      "Evaluating, I see that this is important in vacancies for Brazilians. You don't solve a problem if you don't understand it. You need a problem-solving approach to communication, transparency. - P19",
      "This helps me, because I try to understand. If I try to understand, I use the Portuguese language to my advantage. If we don't know Portuguese and communicate well, it's difficult to solve the problem. - P19",
      "What I noticed [...] is that many vacancies seem to be looking for a professional who is an expert in everything, asking for various things that are difficult to acquire in a short time. It's possible, but thinking of a normal scenario, of people who are building a career, it's very complicated to acquire so much information in so little time. - P20",
      "For a junior developer position, it is expected that the candidate has programming logic, I agree that this is undeniable. However, it is difficult to fully master a language in all its aspects. After all, they are still junior, at the beginning of their career, and need support. - P20",
      "This is something that vacancies do not demonstrate clearly. Although some companies make it clear that the person will enter as a junior, the vacancy becomes a gigantic obstacle to reach the ideal. - P20",
      "Another lack of clarity, especially in LinkedIn vacancies, is seniority. I've seen vacancies with the title 'Junior Developer', but marked as mid-level or senior on the platform, or asking for 3 to 5 years of experience, a time usually required for mid-level. - P20",
      "This clarity, which is basic, seems not to exist. Lastly, the work mode: in-office, hybrid, or remote. Many times the vacancy is listed as 'Remote - Brazil', but in the description, they require residence in a certain state. - P20",
      "some companies detail well what they want, but others seem like they sometimes don't know what they want. - P21",
      "many companies are very, how can I say, very generic in what they put. - P21",
      "a vacancy requires automated testing [...] but it doesn't specify it in the vacancy. - P21",
      "in the vacancy, it only said they wanted a person who knew how to work with automated testing and basic programming logic, that's it, but there was no clarity like, hey, I need a person who develops the tests - P21",
      "Some companies are more detailed [...] but they are few. usually they are larger companies - P21",
      "many times it seems that the person who posts the vacancy on LinkedIn [...] just copies and pastes a ready-made text and doesn't look at it - P21",
      "I think companies could be a little more sensitive [...] Let's make a post on LinkedIn talking about our ideal employee profile, - P21"
    ],
    "T9": [
      "And another thing, it's not usually in the description, but they don't give much feedback on the processes, but I think that's something for later. Related to job descriptions, something to improve would be the description of what the minimum salary they pay is. - P12"
    ],
    "T8": [
      "Because they should justify better these issues of... benefits, salary, and the technologies that, in fact, that project, they need at that moment. Not put absurd things that often discourage the candidate. - P04",
      "It could be part of my feelings 'I don't know if this was the vacancy'. Working involves trust. You have to trust the person to execute a job. - P19"
    ],
    "T2": [
      "But on LinkedIn, I stopped looking there a long time ago because... of these complaints I just mentioned [they're either asking for too much, or things that aren't necessary], and also because there's a lot of Gupy, and I think people looking for jobs can't... end up sending too many resumes and won't be able to keep up with Gupy - P16"
    ],
    "T10": [
      "Man, I think that, in a way... For equality today, like, I don't know if this would be the answer, but in the sense of, like, today vacancies are very restricted to those who already have some experience. I don't know if this would be the answer, right? Like, the best answer. But in this sense of equality [...] - P03",
      "[...] today I see the market much more closed to those with little or no experience, almost completely closed. Right? And it's a bit more accessible to those who have already had some experience, so there's that barrier for new people to manage to, right, get a job. - P03",
      "As I've already mentioned, I find it unfair when there is no response, or when the vacancy demands more than expected for the level (junior, mid-level, or senior) and the salary does not match the requirements. - P06"
    ],
    "T5": [
      "Some, I'd say are pointless, others are cool, are better. Some technical tests I find pointless, for example, they don't specify in the vacancy what... - P03",
      "And the requirement of professional experience with a certain technology, for example, two years, also restricts access to the vacancy. Not everyone can apply. - P06"
    ],
    "T6": [
      "It's further from my house than other places and the duties are excessive. [...] The negative points started to outweigh the positive points. - P14",
      "As it's an internship, the crucial thing is to learn. The intern is in training. [...] A developer doing a degree with 15 or 20 items to fill and earn a thousand reais… [...] They want a Swiss army knife. - P19",
      "When I worked in-office, it was five hours by bus per day. I feel this lack of opportunity, especially with the option of hybrid or remote. Someone distant can work from anywhere. - P20"
    ]
  },
  "AP17": {
    "T7": [
      "I find the criteria often flawed, without clarity. [...] You don't see a criterion. [...] many times they don't bring clarity as to why you didn't pass. - P11",
      "The problem is that most of these systems are terrible, man. If you have a resume that was made in Canva, these models won't read it, understand? Then you're screwed. - P17"
    ],
    "T1": [
      "It's very complicated, I understand the company's part in trying to show what a junior person is. They can say they want someone with knowledge in certain technologies, but who measures this knowledge? How can you measure it? - P11"
    ],
    "T3": [
      "[...] sometimes, the feedback can be feedback that is not very real. Sometimes, it can be a point where you were on a specific day and were feeling a bit down [...] and you ended up failing on some behavioral point, for example. - P09"
    ],
    "T10": [
      "The initial part you have with the recruiter also depends on a factor, whether the recruiter will or not... [...] if they don't like your profile, they sometimes judge you there and that's it, you see? - P04",
      "Yes, if they don't like your profile, they sometimes judge you there and that's it, you see? - P04",
      "Let me see an example I can remember now. Ah, I've had some vacancies, for example, when I see that there are some friends who... some mutual friends, by profession, and then I say: 'look, I applied for this vacancy, if you want to try too, it fits your profile', and then there was a case where there was an issue with a test - P05",
      "[...] or else someone recommended a vacancy to me, said: 'ah, the test time was six hours', then when I went to check, it was a reduced time, and then I don't know if it was because the process was already, was already a bit rushed, they reduced the test time, but I think that's a bit unfair, for one candidate to have more time [...] - P05",
      "Even here in Brazil, this exists, yes it does. Processes where, if you're from the Northeast, the bar is higher. If you're from the North, the bar is higher. Ah, because you live in the South. Ah, the vacancy is for the South. - P12",
      "Something I feel happens nowadays, and it's something that is… like… even a bit blatant, you start applying for vacancies, you end up noticing that something that counts a lot is the issue of referral. - P15",
      "many times, some companies end up… I think in this part, mainly, of you breaking through the bubble of initial positions, like intern and junior, is… the company really won't be caring so much about your technical quality, and it's more important for the company to have reliable people in the business. - P15",
      "it was for a person who had a certain level of knowledge below mine, you see? And then I lost a good opportunity because of nonsense, like that. But it's not fair. - P16",
      "It's not fair the way resumes are analyzed, these issues. In the company I'm in now... it's even strange, because they are very different. When I joined the company, they did applications through forms - P16",
      "I find it very... unfair. Because everyone has a certain capacity and should be evaluated by their capacity and way of working there. So, that's why it's also important to have the test and all. - P16",
      "I think they are picking some at random. Like, if you were lucky enough to be drawn, then you will be able to be evaluated. But I think the reality today is that people aren't being evaluated equally, in an egalitarian way - P17",
      "The entry is egalitarian. I don't know if the exit is. [...] Equality is not treating everyone the same, it's treating the different with the differences they require. - P19",
      "I think all are unfair. It's difficult to be fair in a selection. If there isn't a trial period, like in internships, it's difficult to evaluate. - P19",
      "you are a professional who has a colorful resume [...] If you submit a resume like that [...] you will end up not even being... you will be at the bottom. - P21"
    ],
    "T5": [
      "[...] they are things like that. They are usually the best. Now, just complementing, written technical tests, things like that, in my view, are pointless. Because they don't give you a script. 'Ah, study this here because some things might come up.' It doesn't exist. You understand? - P03",
      "several applications you make, you have about ten tests, seven, five tests for you to do, and they are based only on your scores. - P15",
      "many people can go there, get a GPT, copy and paste it, and answer everything at a hundred, and I don't think it will even… equate… It won't see how you answered each test, but your score. - P15"
    ],
    "T4": [
      "And then, in this practical test, there was just a... general overview of what was to be developed, [...] and then there was the description: 'develop such application with such thing, and we will evaluate your code'. And then there wasn't a very well-defined criterion. Basically, they would evaluate your code. That was the criterion. - P09",
      "It's not transparent. The criteria should be aligned with some company problem. - P19"
    ]
  },
  "AP15": {
    "T7": [
      "Yes, but most of the time it was in those first parts, like, when I was doing the logic tests. In my view, it didn't make sense, because I believe feedback is about the company's evaluation, and how to evaluate a company just by a logic test? - P11"
    ],
    "T3": [
      "No, no company has ever asked me to provide this feedback. - P05",
      "No, in the processes I participated in, I was never asked to evaluate the recruiter, I never received any form for that. - P06",
      "No, worse luck. It was never [asked to provide feedback]. - P08",
      "Man, about the process, I was never asked to do that, in any way. - P09",
      "Yes, it has been. And there are few companies that ask about the process, like, in my experience. So, not every company is very concerned with what the candidate thought of the process. So, I find it kind of, like, problematic, you know? - P10",
      "thinking about it here, like, off the cuff, I can't remember a specific situation. Because I believe some emails really come there for you to give a response, for you to ask something. - P15",
      "Man, they never asked me to give feedback on the recruitment process. I don't think so. - P17"
    ],
    "T4": [
      "Yes, in some… very rarely, I'll tell you, very rarely, but yes, this in informal conversation, okay, after we talked, after we, like, we had set aside, I don't know, an hour, an hour and a half to talk, and right at the end I asked for feedback, okay, and then afterwards the person also asked for feedback, right, the recruiter, usually when it happened, when we, when the conversation was very good, right? - P12"
    ]
  },
  "AP08": {
    "T7": [
      "Because if there are no more mature processes in selecting people to join, how will there be mature processes within the company, right? [...] the company's communication with me, with the person doing the selection process, normally greatly influences the way... how I think it will be within the company, you know. - P13",
      "they sold themselves as a place that was taking great self-care with the people participating in the process and that they would have a “little feeling,” you know, of treating this. But it ended up kind of not happening. - P14",
      "For these vacancies I mentioned, there's no day-to-day part. So communication is more important. Especially for remote vacancies, because you're not in the company's day-to-day. - P19",
      "The issue is that this is more common in the interview with HR, not with the manager. HR shows how the company sells itself, while the manager, many times, doesn't show what the company is like in the day-to-day work. - P20"
    ],
    "T1": [
      "This part I see is more summarized, I think the candidate needs to research more to understand what the company does, what service it provides, etc. - P06",
      "They focus more on hard skills characteristics, [...] and end up neglecting this part of culture, of identification. - P07",
      "More local ads usually don't have this description of the culture and then the job description. It's really the direct job. - P14"
    ],
    "T3": [
      "at least for me, it's still not very clear how companies treat this, right? Because, many times, you don't fit… In most responses, it's that your profile won't fit, sometimes, also the company's culture. And this is also not clear. - P15"
    ],
    "T8": [
      "Ah, that's very difficult to convey in an ad, right? Usually they try to convey that the company is the best in the world, right? The company is the Great Place to Work [...] Sometimes the maestro comes here. - P01",
      "I think it's very difficult for the company to convey in a selection process what the company culture would be like or how people act according to this culture. - P01",
      "Look, the ad itself I believe not. I'm sure not, because a company I think is a set of complex things. The day-to-day dynamic is different, the values, however expressed in texts, may not be so exactly in reality. - P02",
      "For example, there's a value of cooperativeness, but the way the company applies this value of cooperativeness is a bit different from other companies. So, it's not because it's described in the vacancy that in day-to-day life it will be exactly like that. - P02",
      "So, I think that with experience, people acquire these values, which are normally described, but in a vacancy, an ad like that, on LinkedIn, on Gupy, I think it doesn't cover it. - P02",
      "And in the part of values, I don't know if there's much to improve. [...] maybe a little more detail, I don't know, maybe some PDF with the company's history that conveys these values, like that, right? - P02",
      "[...] I always heard a lot about cultural alignment, about sharing, about living the same values that the company shares. I think that makes sense in theory, but, like, at least in the companies I've been through, these cultural values were kind of like dates in the year - P02",
      "[...] that this type of value was exalted. But in day-to-day life they were all the same, like, you know? You had a demand to do, you had to program something and you opened VS Code and did it. - P02",
      "Then I would say that eighty percent don't provide it. Like, it would be utopian, but nobody is going to say that their company is toxic or their team is bad. - P03",
      "A place that doesn't have endless overtime, that at least the team... But then you usually only know when you're inside, right, unfortunately. But you can get a vision of the company. When the team is more collaborative, it's interesting, even though we still work a lot in the home office model, it's a positive point [...] - P03",
      "No. Usually, it's more about the technical part, the level of education, but when you actually join, that's when you know what everything is like in the company. - P04",
      "Sometimes, you're recruited, it seems like a thousand wonders, but when you join, it's something completely different, it's disorganized and all. - P04",
      "I haven't had any cultural alignment, but I think it's important for you to understand how the company works, how it's done, I don't know, the company's organization, how it's done, I don't know, like, that's... - P04",
      "When you go to apply, at least there on LinkedIn, there's a section about the company's culture, which says wonderful things, but in practice, it doesn't exist. So, they put it, but sometimes they don't even have those processes there. - P05",
      "[...] this cultural part, if the company is not adept at this nowadays, for me, this company, man, it's prone to go bankrupt, for sure, and I wouldn't join a company like that, okay? - P07",
      "No, it's very difficult to see vacancies that comment more on something related to the company's culture. Generally, they focus a lot on the functionality of that vacancy the candidate will work on. [I would like to see more about] culture, more personal aspects of the team, even what type of team we will work with - P08",
      "[I would like to see more about] culture, more personal aspects of the team, even what type of team we will work with, which is a team that encompasses a junction of teams related to an end client... - P08",
      "[...] and when they got there, the culture didn't meet their criteria, so I think the user… ended up getting a bit discouraged related to personal growth, related to the development of tasks - P08",
      "Man, in my point of view, I think no vacancy can really convey the company's culture, you know? Because it's very difficult... - P09",
      "[...] only by experiencing it there, with the company's staff, can you really get a vision of what it's like. [...] about 20%, maybe 40%, of the company's vision can be considered, you know? - P09",
      "Regarding the company culture issue, maybe putting an employee there who could be contacted [...] or having a kind of anonymous form of people talking about the culture - P09",
      "[...] for you to already know if that's a place you'll stay for a long time [...] or if you don't even really like going there, or if you plan to go there and spend some time and [...] look for another opportunity - P09",
      "I think it's essential, like I told you. It's the first topic I listed as important, cultural fit. Because sometimes you have everything, you match the requirements, you match the function, you see a really cool salary there, but the organizational climate is horrible. - P10",
      "[...] the organizational climate is horrible. This is not sustainable in the long run, with a good salary, with a position you already have some experience in, this becomes a snowball. - P10",
      "It's just you leaving before, having a burnout, having some psychological issue that could have been avoided, right? - P10",
      "Depending on whether it was something simpler or more rigid, you could already tell by the way the vacancy was made available. - P13",
      "So, it didn't give me, you know, that dedication, that desire to be there, not even to dedicate myself so much to… um… give my best, you know? [...] I'm at work, just another day here. It wasn't like, 'oh my God, I'm at work, this is great!' - P14",
      "you are talking directly with the company, you are talking directly with… as if it were the company's spokesperson, so the company will show you what it wants to show you. - P15",
      "I believe that the issue of transparency can… happen that many companies don't have much, because they won't talk about the skeletons in their closet and all that. - P15",
      "what happens nowadays is largely that the company is not totally transparent regarding its culture and environment, in these selection processes objectively with the candidate. - P15",
      "But, usually, this fit is not very clear, right? I think for some companies it's not very clear what they want. - P15",
      "Some vacancies express this sense well and others you need to research a bit more about the company, go to the website, read a little about the company itself to try to understand, try to see if there's that fit. - P16",
      "mainly culture and leadership. My experiences, they weren't so good, except for the current company I work for. [...] I had a leader who wasn't a leader, he was a guy who gave orders... - P16",
      "what's most out there are companies advertising Great Place to Work and we know it's just burnout [...] we are a young company, we are a company... we are family. When I see this family talk, I already understand where it's going - P17",
      "Cultural fit I think is fair, you know? [...] But most of the ones I did, like, I found them very, like, meaningless. [...] from left to right, what suits you best?. Then it's, like, on one side there is, I don't know, I like hamburgers, and on the other there is, I don't know, I like my family. - P17",
      "Man, I think cultural fit is very important, very important indeed. I just don't really like the way it's been done lately. Like I told you, few that I did I found useful. - P17",
      "It's very difficult to do a company interview because, whether you like it or not, they put on a bit of makeup there, right? [...] you'll only really know what the company culture is like in practice. - P18",
      "I don't take it much into consideration, you know? Because the image that HR tries to pass of a company [...] sometimes it's a bit distorted, right? - P18",
      "If the criteria are clearer… Most vacancies have a list of 20 prerequisites to earn less than minimum wage. I wonder if the company's culture is aligned with mine. - P19",
      "Only by working to know. You'll only really know when… If there's nothing blatant, as you said, something religious. The fit is in the day-to-day. - P19",
      "I confess I don't think they provide it well, no. This issue of culture is something I've seen debates about, because of Gupy and the 'cultural fit'. - P20",
      "It seems more like a guessing game than the company really showing who it is. There are cases where the company calls itself 'family-like', but if the candidate presents themselves as someone who wants to work in a family environment, they don't pass the cultural fit. - P20",
      "The same happens if the company is competitive and the candidate shows themselves as competitive. It's so vague... I confess I don't know how to measure a company's culture. I understand how this can affect, but not how to measure it. - P20",
      "The importance of cultural alignment is knowing where I will work and if I will feel good there. But I find it very difficult for the company to know me or for me to know the company thoroughly just with a short questionnaire, asking if I am motivated, determined, for example. - P20",
      "It's important to understand if I will feel respected in that place, but, just from a five-minute questionnaire, it's complicated to reach an accurate conclusion. - P20",
      "many times it's very subjective. Very, very, very subjective. You don't have a right answer. - P21",
      "sometimes I think you end up, the company ends up losing a great professional because of cultural fit - P21"
    ],
    "T2": [
      "There isn't much company feedback on LinkedIn, but Glassdoor is a tool I use extensively when I want to know what the corporate environment is like, benefits, because there you have more of an employee's view than, strictly speaking, a perfumed little thing on LinkedIn [...] - P03",
      "Because if you don't find anything about the company, you already feel a bit behind, right? Wanting to know what it's like there. - P09",
      "I also look for reviews on sites like Glassdoor, to try to understand the culture. Sometimes, the company says it has a friendly environment, but when we see the reviews, many people say the company is toxic - P11",
      "I evaluate mainly by looking at Glassdoor, where you can get anonymous information, see the company's environment, if it's a company that will have a more toxic environment - P15",
      "But I already see reports, various forums, for example, that it's not really like that in most companies, that in the vast minority, you won't have very good transparency about what the company is like, I think. - P15",
      "[...] besides the pages and what the company wants to show the world, although I don't trust that so much, as it's up to the company to present itself. Obviously, it will want to present itself as the best in the world. - P20",
      "it always talks about the company's culture, right? But, many times, I usually try to see some feedback from Glassdoor beforehand - P21"
    ],
    "T10": [
      "When the company gives a feeling of lack of transparency, and does not act according to what it preaches, this affects a lot. Many companies highlight transparency in their profiles, but, in practice, this ends up not happening. - P20"
    ]
  },
  "AP21": {
    "T7": [
      "they sold themselves as a place that was taking great self-care with the people participating in the process and that they would have a “little feeling,” you know, of treating this. But it ended up kind of not happening. - P14"
    ],
    "T3": [
      "I've participated in a selection process where I did a technical challenge, and they rejected me. And I asked: look, I wanted to know the reason for the rejection [...] Then okay. Luan, we're going to put together a document here, and in a week we'll send it to you. [...] nothing - P17"
    ],
    "T8": [
      "[...] I always heard a lot about cultural alignment, about sharing, about living the same values that the company shares. I think that makes sense in theory, but, like, at least in the companies I've been through, these cultural values were kind of like dates in the year - P02",
      "[...] that this type of value was exalted. But in day-to-day life they were all the same, like, you know? You had a demand to do, you had to program something and you opened VS Code and did it. - P02",
      "But, man, I don't even know, because even that Great Place to Work, right, that people, anyway, I don't even know if that's the name, that, anyway, ranks companies for a good corporate environment. Even, sometimes, the company has that seal, but it doesn't really reflect what happens inside the company [...] - P03",
      "Sometimes, you're recruited, it seems like a thousand wonders, but when you join, it's something completely different, it's disorganized and all. - P04",
      "When you go to apply, at least there on LinkedIn, there's a section about the company's culture, which says wonderful things, but in practice, it doesn't exist. So, they put it, but sometimes they don't even have those processes there. - P05",
      "what's most out there are companies advertising Great Place to Work and we know it's just burnout [...] we are a young company, we are a company... we are family. When I see this family talk, I already understand where it's going - P17",
      "I don't take it much into consideration, you know? Because the image that HR tries to pass of a company [...] sometimes it's a bit distorted, right? - P18"
    ],
    "T2": [
      "There isn't much company feedback on LinkedIn, but Glassdoor is a tool I use extensively when I want to know what the corporate environment is like, benefits, because there you have more of an employee's view than, strictly speaking, a perfumed little thing on LinkedIn [...] - P03",
      "[...] besides the pages and what the company wants to show the world, although I don't trust that so much, as it's up to the company to present itself. Obviously, it will want to present itself as the best in the world. - P20"
    ],
    "T6": [
      "it didn't pay well enough for everything it wanted. You couldn't even say it was an internship that, even if it charged, it paid a little better than average. No, it was just average, you know? - P14"
    ]
  },
  "AP22": {
    "T7": [
      "I missed some classes, because the interview was during class time… what else? It ended up that there was this test that kind of everyone who left it said they didn't feel they did well - P14"
    ],
    "T5": [
      "Look, I think that, at least in the technical tests I participated in, I found them super relevant. There are some technical tests that people simply gave up on and started doing. - P02",
      "And these people were... definitively eliminated, you know? So, I don't know, the next elective with a hundred people doing a technical test, fifty people, with four people submitting and all the rest being eliminated. - P02",
      "Then the worst, there was one that was a technical test, the lady opened the document in a call, said the call would be recorded and that I couldn't search, you understand? Then I thought: 'Is this an entrance exam?' - P03",
      "There are some... There was one that was... Fifteen questions to do in ten minutes... But then... The questions were like... Something... To really think about... And do calculations... I wasn't even thinking about doing calculations... - P13",
      "Now, the biggest problem is when there are companies that want to ask for cultural fit, that want to ask for... a logic test. Logic tests are horrible! And I've done some logic tests that are absurd, man, that... they're designed to drive you crazy! - P17",
      "It's not 'do the maximum you can'. If you always demand the maximum, when you need the real maximum, you won't have it. - P19",
      "This applies to college assignments. If there's no limit, we don't know the materiality of what will be delivered. [...] It gives me the notion that they know what they're asking for. - P19",
      "If the vacancy is for a Java developer, the test should be in Java. But what challenge? If it's too complex, like building an application from scratch in three days, and the candidate receives the email late Thursday night and has to deliver by Saturday? - P20",
      "Will they have to stop everything to do the activity? It's a lost opportunity. - P20"
    ]
  },
  "AP04": {
    "T7": [
      "It burns everyone's reputation. It might be a case of going to social media and giving an opinion about the company. You have to be patient in early-career vacancies. - P19"
    ],
    "T2": [
      "then you see it's a company, you look at Manguito [Glassdoor] or some job site and the company has like two stars, three stars, so you get a bit wary, right? - P01",
      "But, man, I don't even know, because even that Great Place to Work, right, that people, anyway, I don't even know if that's the name, that, anyway, ranks companies for a good corporate environment. Even, sometimes, the company has that seal, but it doesn't really reflect what happens inside the company [...] - P03",
      "Even, sometimes, the company has that seal [Great Place to Work], but it doesn't really reflect what happens inside the company, because kind of some employees are forced to answer that positively, you see? - P03",
      "About the organizations. So, if I see that the company has many bad reviews, or has... Or like, I don't know, sometimes the company didn't inform about the salary, and I see there that the salary is very bad... Then, like, I already get, I no longer feel comfortable proceeding with that selection process. - P05",
      "In the past, when I was starting out, like, right at the beginning, I kind of applied for several vacancies, then I didn't give much importance to it. But today I, I'm very selective. So, that, for me, influences a lot. There was always negative feedback from employees [...] - P05",
      "In this research process, I see many feedbacks in the comments, from people saying if they received a response, if they didn't… [...] the Gupy site – I've applied there numerous times and never got a response. - P06",
      "I also look for reviews on sites like Glassdoor, to try to understand the culture. Sometimes, the company says it has a friendly environment, but when we see the reviews, many people say the company is toxic - P11",
      "But I already see reports, various forums, for example, that it's not really like that in most companies, that in the vast minority, you won't have very good transparency about what the company is like, I think. - P15",
      "if I see a negative comment, I'm less worried, now if I see other very similar reports, then I get a bit more worried. - P18",
      "You can make a pre-judgment, although it's not so clear, as there's doubt whether the person was being sincere or just angry with the company. But it's still a parameter. - P20"
    ],
    "T6": [
      "Usually it's at the company. Many companies hire a lot... But they also fire a lot, they stay in that volatility. So, I analyze... These factors are crucial for me. The time people are at the company... For example, me, at least for me, I don't want to keep jumping from company to company - P05",
      "I want to be a senior within that company, and for that I'll have to spend some time, acquire my experiences, and then if I'm going to join a company where the average for each employee is one year there, then I don't even, no longer, I no longer want to go to that company. So it would be the salary issue, it would be the time - P05"
    ]
  },
  "AP18": {
    "T1": [
      "[...] with everything, check everything', but when we join, we don't even use half of that, like: 'Ah, automated tests using tool x', when you join, sometimes it's just functional tests, that you see automation [...] - P04",
      "Today, at least in the experiences I've had, I feel there are vacancies that demand a lot, and when you advance in the selection process, you see that the company required technology they don't even use, nor plan to use in the future. - P05",
      "I see many companies requiring automation tools, but when you get to the end of the selection process they say: we don't automate yet, it's something for the future. - P05",
      "If I see requirements that don't make sense, I have difficulty knowing if they have a problem to be solved. [...] If I say: I have this problem in data science [...] For that, you don't use Java, you use Python. - P19"
    ],
    "T10": [
      "I was treated fairly in all the processes I participated in. But then there was this one where they asked a question that didn't fit the nature of the work. - P04",
      "Entry is facilitated by access to information. [...] But they demand so much in content, that they forget the behavioral factor. - P19",
      "Working is not just responding to a problem, it's working with people, in the environment, in the culture. Entry is facilitated, egalitarian, but the final product, I don't know. - P19"
    ],
    "T5": [
      "I believe more in tests that are more specific to your vacancy… that you are applying for. You can… gosh, I can't even count the number of tests I've done related to Portuguese tests, logic tests, which sometimes can't really prove the candidate's quality, their technical quality. - P15",
      "many people can go there, get a GPT, copy and paste it, and answer everything at a hundred, and I don't think it will even… equate… It won't see how you answered each test, but your score. - P15",
      "some other tests there, like Portuguese and some things that won't really affect or measure your quality… - P15"
    ],
    "T4": [
      "I'm kind of against it [the standard]. Like, most follow a… Ah, you apply, a little logic test that has no relation to the vacancy, normally it's just a logic test to level. - P07"
    ]
  },
  "AP06": {
    "T1": [
      "[...] they give you there... There's no reason for you to just study for, if by chance, in the future, you need that, you know. You see? I think that breaks the candidate a lot too. I think they should specify that better. - P04",
      "I think companies need to be more direct. Sometimes you see a job ad and there are a thousand and one pieces of information. I think when the text is more concise, it's easier for you to understand. It's better for companies to make the whole process more objective. - P05",
      "Man, in the vacancies I've been seeing and following, usually, people give a somewhat generic description, sometimes, too much. Or else, they put a lot of things. [...] specifically for the development area, sometimes, you see a very long list of requirements [...] - P09",
      "I think most today, yes, you know? But you find many vacancies in that first model I told you about, about a non-technical person writing the vacancy, you know? Then usually you will be the IT guy. - P17",
      "it can lead to social issues, not everyone is used to or has the discernment to interpret the text that people put there in the application, you know? - P18",
      "Either you have to be a superhero to learn everything, or it's an illusory vacancy. [...] There are many complicated ads, with unprofessional descriptions. I've seen 'we don't like whining'. Then they change the ad. - P19"
    ],
    "T8": [
      "Because they should justify better these issues of... benefits, salary, and the technologies that, in fact, that project, they need at that moment. Not put absurd things that often discourage the candidate. - P04"
    ]
  },
  "AP24": {
    "T1": [
      "if the company adds many icons in the job description, then it hinders screen readers, if it uses many special symbols too, I see that many companies do this, they put many emoticons, they put rainbows, they put a lot of things, so this, in a way, hinders these people. - P05"
    ]
  },
  "AP23": {
    "T1": [
      "It's a very large detail, as if the person were going to use all of that. Sometimes, I open a Junior vacancy and it says I'll have to work with Java 8, Java 17, Docker, Kubernetes, AWS - P11",
      "I think describing the activities well. [...] Web developer, you know there are a million different ways to be a web developer. Then, sometimes, I've seen vacancies with, like, you have to have Angular, React, [...] that are not in the same project - P17",
      "Either you have to be a superhero to learn everything, or it's an illusory vacancy. [...] There are many complicated ads, with unprofessional descriptions. I've seen 'we don't like whining'. Then they change the ad. - P19",
      "What I noticed [...] is that many vacancies seem to be looking for a professional who is an expert in everything, asking for various things that are difficult to acquire in a short time. It's possible, but thinking of a normal scenario, of people who are building a career, it's very complicated to acquire so much information in so little time. - P20"
    ],
    "T10": [
      "I think that, in some cases, requirements like a completed degree, almost completed, or in progress limit candidates. Sometimes, the candidate has good knowledge, but does not have a degree. - P06",
      "I've had interviews where they… it seemed like they focused mainly on candidates who attended federal universities, so I saw that as a benefit for me - P08",
      "It's common in Japan to choose someone who studied Letters to work in a factory. I consider selections unfair. The vast majority. I said 'all' to make it clear that most are difficult to consider fair. - P19"
    ]
  },
  "AP11": {
    "T3": [
      "the feedbacks I had, at least so far, were nothing related to technical aspects. [...] the ones I had were really more about… [...] they were less busy, had a connection or some reason, maybe, even better - P14",
      "But the girl who passed, she had more connections with the Porto Digital companies [...] And also, at least, a feedback for me that I really saw I failed [...] was in my activity description. - P14"
    ],
    "T10": [
      "I've seen many vacancies specific to black people, specific to women, specific to men, I think that's absurd [...] - P01",
      "sometimes a person who doesn't have much... Much experience, nor much alignment with the vacancy, but because they wrote a resume, I don't know, the way the robot wanted to see it, was seen. - P01",
      "[...] because… Interviews done… because there's a detail too. Interviews done by women are different from interviews done by men. When it's a technical interview, the technical interview doesn't matter, you know? [...] they will analyze something more professional [...] - P04",
      "Now, when the recruiter is male, I don't like it. Because it's the first contact we have. [...] But this other one, he… No, it was the fourth. Anyway, I don't know the order anymore. I know there was one, this one who asked me, was male [...] - P04",
      "The initial part you have with the recruiter also depends on a factor, whether the recruiter will or not... [...] if they don't like your profile, they sometimes judge you there and that's it, you see? - P04",
      "Yes, if they don't like your profile, they sometimes judge you there and that's it, you see? - P04",
      "I feel uncomfortable. There have been, for example, vacancies I was going to apply for and there in the vacancy they asked you to immediately inform your mother's name, father's name, CPF [social security number], RG [ID card], I find it unnecessary, even for the first moment. In fact, I think this even violates a law, which is the data protection law. Some companies do this. - P05",
      "And also there are many companies, at least for us women, many companies ask: 'oh, do you have children? Are you married?' So, that's very uncomfortable, because, like, I find it rather irrelevant to know if I have children or not at that moment, right at that first moment. - P05",
      "Let me see an example I can remember now. Ah, I've had some vacancies, for example, when I see that there are some friends who... some mutual friends, by profession, and then I say: 'look, I applied for this vacancy, if you want to try too, it fits your profile', and then there was a case where there was an issue with a test - P05",
      "[...] or else someone recommended a vacancy to me, said: 'ah, the test time was six hours', then when I went to check, it was a reduced time, and then I don't know if it was because the process was already, was already a bit rushed, they reduced the test time, but I think that's a bit unfair, for one candidate to have more time [...] - P05",
      "There are companies that end up adopting a system where if someone internal suggests a candidate, they have a better chance of being hired in the end or not. - P08",
      "And I believe that companies currently focus a lot on… a certain range of initial candidates. So, if they find a candidate they think is strong at the beginning, candidates who could still have been interviewed... - P08",
      "But I think this part of justice comes more into this part of me suggesting… as already a member of the company, a friend, a person I know has that knowledge, they will certainly have eighty percent... - P08",
      "[...] with the exception of in-person vacancies, of course. Generally, in in-person vacancies, people prefer those who are already from the city, for example. It would be a factor of inequality, but it's something very specific. - P09",
      "[...] speaking in person, I feel a very big difference in the number of women for vacancies and everything. And even, there was a company I went to... [...] they asked if they were more interested in what the men had to say and not the women - P10",
      "[...] the first contact with the person who doesn't respect LGPD [Brazilian General Data Protection Law], asking for sensitive data that has nothing to do with that modality, with that action that is happening, for me it's a company that already shows certain disrespect, you know, with the person. - P10",
      "[...] the person puts it there, but the preference is for who indicates. This won't be explicit. So, like, I think it's very much about the issue, literally, of the cultural fit of that company, the company's culture. - P10",
      "Even here in Brazil, this exists, yes it does. Processes where, if you're from the Northeast, the bar is higher. If you're from the North, the bar is higher. Ah, because you live in the South. Ah, the vacancy is for the South. - P12",
      "But it's a good topic, because mainly the ones that are platform-based… if they don't want to fill some quota, something for PCD [Person with Disability], or racial percentage issue for gender diversity [...] they won't prioritize this, they'll just really… do the selection process with normal little phases of submitting your resume and that's it. And that's it. - P14",
      "Something I feel happens nowadays, and it's something that is… like… even a bit blatant, you start applying for vacancies, you end up noticing that something that counts a lot is the issue of referral. - P15",
      "That's where the referral part comes in, which is cool. I think, sometimes, it's not very equal for a guy there who doesn't have networking, for example, a guy who doesn't know anyone in the area… to apply for the vacancy along with other people who have uncles, have friends, family friends, who are already in the market there - P15",
      "I agree that… It's better for the company to have more reliable employees within the company. But those who… get fat [benefit from connections]… sometimes can end up sinning a bit. - P15",
      "Some do this, but I believe that most there… many people end up getting a “no” because they don't have a referral, don't have a very strong network there with someone from the company. - P15",
      "I believe regarding… treating… I think… for example… treating all candidates equally is something that doesn't happen… - P15",
      "also a lot about that equality issue I mentioned earlier, of referrals and all that. - P15",
      "So I think this part here of them being fair with each candidate may not happen very well. - P15",
      "I think this is not very fair to people, but I understand that there are many candidates, so it might happen anyway. But I think these parts here can occur, because, nowadays, companies are not very fair to candidates as a whole. - P15",
      "And she ended up commenting that, like, in the old company she worked for, they used Gupy, and when the person chose the referral option, they always evaluated the referral first. - P16",
      "And then what makes me think is that I think we always have this perception that whoever gets the job, whoever ends up getting the vacancy there, is whoever has the QI – who indicates. And I don't think that's fair - P16",
      "it was for a person who had a certain level of knowledge below mine, you see? And then I lost a good opportunity because of nonsense, like that. But it's not fair. - P16",
      "And not just because it was a referral from so-and-so or because they are the son of so-and-so and such. Anyway, I find it very unfair. - P16",
      "I think they are picking some at random. Like, if you were lucky enough to be drawn, then you will be able to be evaluated. But I think the reality today is that people aren't being evaluated equally, in an egalitarian way - P17",
      "Then, man, it's a college that there won't have that technical requirement that... And, like, right, it won't have that demand for every drop of your soul, but that will be there linked to the main technology companies in Recife, man, you know? - P17",
      "There's a point I told you about right place, right time, and there are some social points too, being able to attend events. [...] And networking is the best thing for you to get good opportunities. - P17",
      "yes, there is a large social and financial pillar behind the scenes. [...] not everyone will be able to visualize all the vacancies precisely because there is this... When you pay, it has greater intelligence. - P18",
      "I think this is flawed, as remote work could be useful for those who live in more distant regions. To go to downtown Rio, I lose at least two hours by bus, and the return trip is never less than two and a half or three hours. - P20"
    ]
  },
  "AP12": {
    "T10": [
      "it shouldn't, right, the issue of appearance or often the issue of education shouldn't [...] - P01",
      "I, personally, find it at least weird, like, right, because we are, like, right, especially in a technical vacancy, right, for a developer, what matters is the hard skill, right, what you know how to do there, and your communication skills, management, right? - P02",
      "That kind of thing. So, when characteristics that are not aligned with these points are taken into account, I think it completely distorted the selection. If it were to call a person for other reasons, it should be described in the requirements. [...] - P02",
      "I think I didn't understand that question very well, but I think I'll answer in terms of gender equality and disability. But, in this case, I think that for women, in some cases, they give preference to male people. - P04",
      "Because there's one thing that, in an interview I did, out of these five, which was the one I didn't want to proceed with, they asked me two questions that I found totally unnecessary. They asked me if I had children. [...] - P04",
      "[...] And they asked a lot of personal stuff that I didn't like. I found it very inconvenient. So much so that, as it was my third interview, I even thought afterwards: 'Wow, does it work like this?' - P04",
      "[...] I know a girl who was fired after returning from maternity leave, and that kind of affected me, I was like: 'Wow, so things work like this?' Because in technology, for example, I only work... [...] there were only men [...] - P04",
      "Ah, I don't like it, I feel uncomfortable. Because you have to, when you're in a job interview, you have to analyze the professional aspects of that person. - P04",
      "So, you can't just ask who she lives with, how many children she has, that type of question is totally irrelevant, totally, and uncomfortable, because sometimes you're like: 'Wow, will this impact this... [...] - P04",
      "[...] my resume here, wonderful, but will the fact that I live with five people and have to work from my home office, will that impact?' So, I think that creates insecurity for the candidate and ends up being something uncomfortable. - P04",
      "I think it was unnecessary. I think they wanted to see. So much so that I think if I had… I felt like researching afterwards who they found, because you can't know, but I'm almost sure it was someone male, [...] - P04",
      "[...] because… Interviews done… because there's a detail too. Interviews done by women are different from interviews done by men. When it's a technical interview, the technical interview doesn't matter, you know? [...] they will analyze something more professional [...] - P04",
      "Now, when the recruiter is male, I don't like it. Because it's the first contact we have. [...] But this other one, he… No, it was the fourth. Anyway, I don't know the order anymore. I know there was one, this one who asked me, was male [...] - P04",
      "I feel uncomfortable. There have been, for example, vacancies I was going to apply for and there in the vacancy they asked you to immediately inform your mother's name, father's name, CPF [social security number], RG [ID card], I find it unnecessary, even for the first moment. In fact, I think this even violates a law, which is the data protection law. Some companies do this. - P05",
      "And also there are many companies, at least for us women, many companies ask: 'oh, do you have children? Are you married?' So, that's very uncomfortable, because, like, I find it rather irrelevant to know if I have children or not at that moment, right at that first moment. - P05",
      "I've also seen vacancies exclusively for women, which limits by gender. - P06",
      "I've never had this experience, but if I did, I would find it negative and wouldn't proceed with the process. The vacancy should require technical knowledge, not this other information. - P06",
      "I've had interviews where they… it seemed like they focused mainly on candidates who attended federal universities, so I saw that as a benefit for me - P08",
      "[...] with the exception of in-person vacancies, of course. Generally, in in-person vacancies, people prefer those who are already from the city, for example. It would be a factor of inequality, but it's something very specific. - P09",
      "Man, in my specific case, I don't even continue with the process. I leave the process right away, because if during the process things like this are already being demanded, I believe that this work environment is not a very nice environment - P09",
      "I, as a woman, and I'm also LGBT, so there's this issue, like, sometimes you're looking, you don't see much representation [...] I think that, besides everything, it's even because of the area we're in. - P10",
      "[...] speaking in person, I feel a very big difference in the number of women for vacancies and everything. And even, there was a company I went to... [...] they asked if they were more interested in what the men had to say and not the women - P10",
      "I don't even enter. Like, there are several situations, for example, where you go, sometimes, to apply, many times, scams... they ask for ID, they ask for mother's name, they ask for I don't know what. I see that, I leave the registration immediately. - P10",
      "[...] the first contact with the person who doesn't respect LGPD [Brazilian General Data Protection Law], asking for sensitive data that has nothing to do with that modality, with that action that is happening, for me it's a company that already shows certain disrespect, you know, with the person. - P10",
      "So, like, besides putting those data, for you to put there, it doesn't say what they will do with those data. [...] Obviously, they will look for some criminal record, something that, like, they shouldn't be looking for without telling you - P10",
      "Even here in Brazil, this exists, yes it does. Processes where, if you're from the Northeast, the bar is higher. If you're from the North, the bar is higher. Ah, because you live in the South. Ah, the vacancy is for the South. - P12",
      "I don't really like this type of information [personal or characteristics unrelated to your work] making a difference in the process. - P12",
      "I don't see much reason to take that into consideration, no. [...] it ends up discriminating to have to take these things into consideration. When we have race and sexuality, it's very much in relation to... [...] using it as a criterion for refusal, never. - P13",
      "I think it depends a lot on the information. You said… it comes to mind: sensitive data. Like, sexuality issue, color issue, and so on. - P14",
      "That's where the referral part comes in, which is cool. I think, sometimes, it's not very equal for a guy there who doesn't have networking, for example, a guy who doesn't know anyone in the area… to apply for the vacancy along with other people who have uncles, have friends, family friends, who are already in the market there - P15",
      "I find it very bad. I don't understand, for example, why we need to state our color or our sexuality in a selection process. I think it's one of the pieces of information, for example, that have no relevance whatsoever, whatever the process may be - P16",
      "I've already applied for vacancies that had these options to be inserted, but they weren't options I really had to insert. But I didn't pursue it, because it didn't interest me, in fact, I didn't want to, like that. - P16",
      "And not just because it was a referral from so-and-so or because they are the son of so-and-so and such. Anyway, I find it very unfair. - P16",
      "I've seen them require a resume with a photo. If there's no other option, it doesn't attract me. My filter already excludes that. Being in an environment where this is important would be difficult to persist. - P19",
      "I'll share an experience with LinkedIn. I live in Nova Iguaçu, Baixada Fluminense, RJ. On my LinkedIn, it said 'Nova Iguaçu, Rio de Janeiro, Brazil'. I wondered why I couldn't get vacancies. - P20",
      "I thought: 'what if I remove 'Nova Iguaçu' and just leave 'Rio de Janeiro, Brazil'?' I started receiving more messages from recruiters, mostly for in-office or hybrid vacancies. - P20",
      "This is never said, but we know it interferes, otherwise they wouldn't ask. We try to fight against this. - P20",
      "I talked to a friend who also goes through selection processes and she doesn't like vacancies aimed only at women. She feels they want to hire her for her gender, not her ability. - P20",
      "This ends up devaluing the candidate, even if the intention seems to help. It's like labeling the person, reducing them to a characteristic instead of considering their ability. And this can generate discrimination. - P20",
      "So, it seems like some candidates are hired for their identity, not their ability. - P20",
      "you are a professional who has a colorful resume [...] If you submit a resume like that [...] you will end up not even being... you will be at the bottom. - P21"
    ]
  }
}