{
  "T1": "Perceptions about the quality, sufficiency, and clarity of information provided directly in job advertisements and vacancy descriptions (requirements, responsibilities, initial culture, etc.).",
  "T2": "Assessment and influence of information about the company or vacancy obtained outside the official R&S process, such as on social media, review sites (Glassdoor, etc.), or reports from other people.",
  "T3": "Experiences and perceptions about receiving feedback (positive or negative, detailed or generic) on their performance in the process stages, as well as the opportunity to provide feedback on the process.",
  "T4": "Perceptions about the methods used to assess behaviors and soft skills (group dynamics, psychometric tests, behavioral interviews), their relevance, transparency, and the candidate's experience with them.",
  "T5": "Perceptions about the methods used to assess technical knowledge and skills (coding tests, practical projects, technical interviews), their relevance to the vacancy and the adequacy of the assessment.",
  "T6": "Perceptions about the information (or lack thereof) related to the concrete aspects of the offer, such as salary, benefits package, opportunities for growth and development in the company.",
  "T7": "Perceptions about the general organization, flow, stages, communication, and professionalism throughout the entire selection process, including interaction with recruiters and the perception of overall transparency.",
  "T8": "Perception of alignment or misalignment between the candidate's values, beliefs, and work environment and those of the organization, as perceived or communicated during the selection process.",
  "T9": "Perceptions about the clarity, frequency, and adequacy of communication regarding the progress of their application in the different stages of the selection process (approval, rejection, deadlines).",
  "T10": "Perception of having been treated fairly, impartially, equitably, and without bias or discrimination throughout the entire selection process, including equality of opportunity and the objectivity of the criteria."
}